{
   "actInfo":[
      {
         "name":"Advanced Accounting",
         "description":"Students continue to master accounting principles and procedures, adding new topics about managerial accounting, cost accounting, financial analysis, and business ethics. Content areas include property, plant and equipment, corporate investments, bonds, notes payable and receivables, amortizations, cash flow statements, and ratio analysis for the corporate structure. Spreadsheet analysis and accounting software applications provide the opportunity for higher-level thinking skill activities and authentic simulations enhance teamwork, decision making, and communication skills. Upon completion, students should be able to demonstrate an understanding of the principles of decision making, problem solving and critical thinking, and apply them to both business and personal financial situations. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year. This course is also available online.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Information Systems",
         "description":"Using project based learning, students apply problem-solving skills to real-life situations through word processing, spreadsheets, databases, multimedia presentations, integrated software activities and the use of the Microsoft Imagine Academy. Students work individually and in groups to explore computer concepts, operating systems, networks, telecommunications, and emerging technologies. Keyboarding instruction will be a component of this course based on student need. Upon successful completion of Information Systems, students may elect to obtain industry-recognized professional certification by taking the Microsoft Office Specialist (MOS) exams. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Programming",
         "description":"The course helps participants understand the processes involved in software development and object-oriented programming. Through real-world projects, students explore computer concepts, apply logic procedures, and implement programming procedures with one or more languages, such as Java Script, C# and Python. Graphical User Interfaces may be used as students design and develop interactive multimedia applications. In addition, HTML or JavaScript may be employed to create Web pages. This is an introductory course that could lead to careers such as software engineer, developer, or game designer. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Advanced Programming",
         "description":"Building on a foundation of programming skills, students will use object-oriented programming to develop applications for Windows, database, multimedia, games, mobile, and/or Web environments. Students learn how to use popular game-development software to create engaging, interactive games in a variety of styles. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Business Cooperative Internship",
         "description":"Business Cooperative Internship allows students to apply what they have learned in the classroom to the real world. The internship experience combines a business course with employment in a business-related field that reflects the student's current career interests. The program offers valuable work experience, enhances employment skills, and develops marketable skills. This course, taken in conjunction with another business course, will earn one to two units of credit. Students who successfully complete 396 hours of supervised on-the-job training in a related occupation will earn one credit. Students who successfully complete 720 hours of supervised on-the-job training in a related occupation will earn two credits.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Business Law",
         "description":"Business Law provides students with the basic knowledge to become a better informed citizen, employee, and consumer. The course offers students the opportunities to study the nature and function of our legal system, courts, and procedures. Topics include contracts, sales agreements, torts, constitutional law, criminal law, and family law. Students focus on consumer rights and responsibilities, examine legal aspects of employment, research careers in law, and discuss the impact of laws on travelers and those living abroad. Enriched with student projects, debates, mock trials, field trips, guest speakers, and Internet activities, the course helps students understand the laws affecting businesses and consumers.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Business Management",
         "description":"Students study basic management concepts and leadership styles as they explore business ownership, planning, economics, international business, and human relations issues such as employee motivation and conflict resolution. Through engaging software simulations, students learn to utilize efficiently and effectively the basic management functions of planning, organizing, staffing, directing, and controlling, and their impact on human and capital resources. Upon completion of this course, students will develop a business plan for a real or simulated business.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Computer Systems Technology 1",
         "description":"Students enter the world of computer technology and gain practical experience in assembling a computer system, installing an operating system, troubleshooting computers and peripherals, and using system tools and diagnostic software. They develop skills in computer networking and resource sharing. In addition, students explore the relationships between internal and external computer components. Emphasis is placed on customer service skills and career exploration. Upon successful completion of the course, students may qualify to take the Comptia IT Fundamentals certification exam. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Computer Systems Technology 2 A+",
         "description":"Building on the foundation of Computer Systems Technology 1, this advanced course provides students with training in procedures for optimizing and troubleshooting concepts for computer systems and subsystems. Students explore wireless technologies (e.g., Bluetooth, Wi-Fi) and create and configure a network. Emphasis is placed on technical proficiency, skill-building, and workplace readiness. The course prepares students for postsecondary education and training, and a successful career in information technology. Upon successful completion of the course, students may qualify to take the Comptia A+ Certification exam. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Database Design And Management 1, Oracle",
         "description":"This is an advanced information technology class that provides complete, hands-on computer training in data modeling and database application software with an emphasis on Oracle 9i. An example of an Oracle web site would be Amazon.com. Students taking this course will be prepared to take Oracle's Introduction to SQL (Structured Query Language) programming exam. Preparation for careers is a major component of this class. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Database Design And Management 2, Oracle",
         "description":"This advanced information technology class offers supervised self-study opportunities for students interested in learning PL/SQL. Students who have previously passed the Oracle SQL exam and pass the PL/SQL exam will earn the Oracle Certified Associate (OCA) designation. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Network Administration 1",
         "description":"Cyber: Network Administration 1 is a comprehensive, hands-on computer course in which students are taught basic networking skills using Windows and Microsoft Server. Topics covered throughout the year include network concepts, installation, configuration, management, and troubleshooting. Network Administration is designed to teach many aspects of computer support and network administration. Students learn networking concepts, from usage to components, and set up peer-to-peer network systems and client server networks. Students install and configure network cards and connect them to networks. Students learn how to install the operating systems, setup and manage accounts, load software, and set up and implement security plans. Upon successful completion of Network Administration, students may elect to obtain industry-recognized professional certification. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Routing And Switching 1a, Cisco",
         "description":"This is part A of a full year course. Part A is taken in the fall semester. Students also register and take Cyber: Routing and Switching 1B, Cisco in the spring semester. This course teaches students the skills needed to obtain entry-level home network installer jobs. It also helps students develop some of the skills needed to become network technicians, computer technicians, cable installers, and help-desk technicians. It provides a hands-on introduction to networking and the Internet, using tools and hardware commonly found in home and small business environments. Labs include PC installation, Internet connectivity, wireless connectivity, file and print sharing, and the installation of game consoles, scanners, and cameras. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Routing And Switching 1b, Cisco",
         "description":"This is part B of a full year course. Part B is taken in the spring semester. Students also register and take Cyber: Routing and Switching 1A, Cisco in the fall semester. This course prepares students for jobs as network technicians and helps them develop additional skills required for computer technicians and help desk technicians. It provides a basic overview of routing and remote access, addressing, and security. It also familiarizes students with servers that provide e-mail services, Web space, and authenticated access. Students learn about the soft skills required for help desk and customer service positions, and the final chapter helps them prepare for the CCENT certification exam. Network monitoring and basic troubleshooting skills are taught in context. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Routing And Switching 2a, Cisco",
         "description":"This is part A of a full year course. Part A is taken in the fall semester. Students also register and take Cyber: Routing and Switching 2B, Cisco in the spring semester. This course familiarizes students with the equipment applications and protocols installed in enterprise networks, with a focus on switched networks, IP Telephony requirements, and security. It also introduces advanced routing protocols such as Enhanced Interior Gateway Routing Protocol (EIGRP) and Open Shortest Path First (OSPF) Protocol. Hands-on exercises, including configuration, installation, and troubleshooting, reinforce student learning. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Routing And Switching 2b, Cisco",
         "description":"This is part B of a full year course. Part B is taken in the spring semester. Students also register and take Cyber: Routing and Switching 2A, Cisco in the fall semester. This course is designed for students interested in pursuing a career in the computer industry. Students will install, configure, upgrade, diagnose, troubleshoot and perform preventive maintenance on computer motherboards, processors, and memory chips. Other areas of study will include basic networking, software operation of Windows and DOS, memory management, and preventive maintenance. The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Cyber: Security + Capstone",
         "description":"This course provides in depth instruction in the basics of network security. Instruction includes security objectives, security architecture, security models and security layers; risk management, network security policy, and security training. The purpose of this course is to instill the basics of network security, aka 'information assurance.' The cooperative education (Business Cooperative Internship--679920) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year. For more information, visit the CTE web site. Industry certification may be available as part of this course.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Gourmet And International Foods",
         "description":"This course allows students to explore food safety and sanitation, prepare and experience the flavor of global cuisines, become skilled in food presentation, and learn about the diverse careers opportunities related to the hospitality, tourism and recreation industry. Skills in mathematics, science, and technology will be reinforced throughout the curriculum.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Teachers For Tomorrow 1",
         "description":"The Teachers for Tomorrow course introduces juniors and seniors to a career in teaching and education. The primary elements of the curriculum components are the learner, the school, the teacher, and teaching. The components are intentionally broad in scope and provide a great deal of flexibility based on the career interest of a student. In addition to the fundamental curriculum components, all students are required to observe and participate in an internship outside the teachers for tomorrow classroom. The internship may involve the preschool level through 12th grade.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Introduction To Culinary Arts",
         "description":"The course focuses on identifying and exploring the individual careers within the foodservice industry. Units of study include food science and technology, dietetics and nutrition services, diverse cuisines and service styles, current trends, food and beverage production and preparation, and food safety and sanitation.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Culinary Arts 1",
         "description":"This course is dedicated to providing students with a working knowledge of classical culinary techniques. Through lecture, hands-on work and projects, the students will learn the skills needed for a career in the foodservice industry. Training in sanitation, hot food production, meat identification and fabrication, pantry, breakfast cookery, purchasing, and basic culinary skills is offered. Curriculum also includes culinary mathematics, field trips, and competitive events.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Culinary Arts 2",
         "description":"This course builds on the skills learned in Culinary Arts 1. Further advanced instruction in table service, baking, pastries, and management techniques is emphasized. Students create a plan for establishing a restaurant that includes menu selection and preparation, facilities design, and management components. Selected students may participate in internship activities as an option in cooperation with the local business community.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Introduction To Early Childhood Careers",
         "description":"Students focus on the principles of child growth and development; development of self-concepts and building self-esteem; appreciation of diversity; learning experiences for children; principles of guiding children in a positive manner; healthy and safe environments; career development; and careers related to early childhood professionals through hands-on exploration, projects, and group learning.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Early Childhood Careers 1",
         "description":"This course is designed to combine the study of child growth and development with participation in the planning and operation of a preschool laboratory for three- and four-year-olds. Opportunity is provided for students to prepare for careers involving child care by focusing on the planning, organizing, and conducting of meaningful play and learning activities; child monitoring and supervision; record keeping; and referral procedures. Critical thinking, practical problem solving, and entrepreneurship opportunities within the field of early childhood education are emphasized. Students prepare for continuing education leading to careers in early childhood fields (e.g., medical, social services, and education).",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Early Childhood Careers 2",
         "description":"This course offers classroom instruction and work based learning experiences through preschool laboratories. Students focus on occupational skills needed by personnel employed in early childhood-related fields, such as workforce development education, medical/health care, social services, counseling, psychology, and entrepreneurship. Class instruction expands on the skills of Early Childhood Careers 1 and includes development of employment strategies. Individual projects and training plans are required for school laboratory work experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Fashion Careers 1",
         "description":"The Fashion Careers 1 students will begin to develop technical and presentation skills in the field of fashion design. The program will emphasize the creative process of design concepts, sketching, draping, pattern making, and garment construction. These skills will enable the student to design and construct a project from creative conception to completion. Students will learn the business of fashion including fabric technology and apparel-production techniques. Teachers emphasize skills in art, communication, mathematics, science and technology in this course. (Students interested in this course should also see Fashion Marketing 1 under Marketing.)",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Fashion Careers 2",
         "description":"Students enrolled in the Fashion Career 2 course focus on technical skills identified as essential for careers in the fashion industry. Students build on existing skills in the areas of design concepts, sketching, pattern making, and garment construction to develop a fashion portfolio. Following the portfolio, a fashion line is executed from conception to completion. Opportunities for entrepreneurship within the field of fashion design are examined. Students will begin to develop a level of professionalism that is standard in the industry. (Students interested in this course should also see Fashion Marketing 1 under Marketing.)",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Teachers For Tomorrow 2",
         "description":"In this advanced level course, students will continue to pursue their interest of careers in education. The primary focus of the class is the teacher and teaching, reinforcing the skills and knowledge needed to prepare students to become future educators. Students will have the opportunity to gain teaching experience through participation in supervised internships outside the teacher cadet classroom. The internships may involve the preschool level through grade 12.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Animal Science 1",
         "description":"Students interested in studying animals and desiring experience in the care of a variety of animals will benefit from this course. The course is designed for students interested in a career in the animal health care field. Core curriculum includes animal anatomy, animal behavior, handling techniques, nutrition, disease pathology, sanitation, and disease control. Students gain hands-on experience working with laboratory animals.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Animal Science 2",
         "description":"Course content progresses from Animal Science 1 and includes more in-depth instruction and skill training necessary for a variety of high-tech animal science employment opportunities. Students continue to work with laboratory animals and have the opportunity to observe or participate at selected animal care facilities, such as veterinary clinics and grooming facilities, throughout the community.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Biotechnology Foundations",
         "description":"This course focuses on various techniques that are used to modify living organisms, or parts of organisms, to improve plants and animals, and the development of microorganisms for specific purposes. Student activities range from bioprocessing and DNA analysis, to medicine, biomechanical systems, and the environment. Students gain insight and understanding about biotechnology career fields.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Biomedical Tech",
         "description":"Students gain foundational knowledge and skills appropriate for a variety of medical-related career paths in the field of biotechnology. They are introduced to diagnostic and therapeutic laboratory procedures that support bioscience research and practice, and they investigate safety, quality assurance, and ethical concerns associated with the field of biomedical technology.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Dental Careers 1",
         "description":"Dental Careers 1 is the first-level course of a two-year dental assisting program. The course content focuses on introducing all dental-related careers as well as competencies necessary to manage a dental office. The curriculum includes head and neck anatomy, infection control, tooth charting, and instrumentation. The dental skills relevant to the curriculum are practiced in a classroom dental clinic.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Exploring Health Sciences",
         "description":"Students must also register for part two, Exploring the Language of Medicine for the spring semester. This course introduces the student to health care careers and develops basic skills common to all health and medical sciences. It is recommended as the first course for other health and medical sciences courses. This course focuses on exploring health careers, communication skills, safety, first aid, and Healthcare Provider CPR.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Exploring The Language Of Medicine",
         "description":"Students must also register for part one, Exploring Health Sciences for the fall semester. This course builds on the foundations of the Exploring Health Sciences course. Exploring the Language of Medicine is designed to help students learn medical terminology. It is presented in logical order, beginning with each body system anatomy and physiology and progressing through pathology, diagnostic procedures, therapeutic interventions, and pharmacology. Concepts, terms, and abbreviations are also presented to the students.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Fire And Emergency Medical Sciences 1",
         "description":"This is part one (fall semester) of a two-part, full-year course. Students must also register for part two, Fire and Emergency Medical Sciences 2 for the spring semester. Fire and Emergency Medical Sciences prepares the student to enter the workforce or pursue further education in the field of Emergency Medical Services (EMS) and Fire Science. The principles and practices of emergency response and firefighting will be explored under the direct supervision of a certified EMT instructor. The curriculum consists of planned learning experiences in the classroom, laboratory, and faculty supervised clinical settings. Students will have the opportunity to observe and interact with a variety of patients experiencing varying degrees of injury or disease that are carefully selected to provide appropriate clinical learning experiences. As preparation, students will be provided with ample lab practice to fully prepare them for the clinical experience and minimize risks. During the course of study, students will have the opportunity to earn N-REMT and other certifications. Offsite clinical lab opportunities with Fairfax County Fire and Rescue may be available to the students.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Fire And Emergency Medical Sciences 2",
         "description":"This is part two (spring semester) of a two-part, full-year course. Students must also register for part one, Fire and Emergency Medical Sciences 1 for the fall semester. Fire and Emergency Medical Sciences prepares the student to enter the workforce or pursue further education in the field of Emergency Medical Services (EMS) and Fire Science. The principles and practices of emergency response and firefighting will be explored under the direct supervision of a certified EMT instructor. The curriculum consists of planned learning experiences in the classroom, laboratory, and faculty supervised clinical settings. Students will have the opportunity to observe and interact with a variety of patients experiencing varying degrees of injury or disease that are carefully selected to provide appropriate clinical learning experiences. As preparation, students will be provided with ample lab practice to fully prepare them for the clinical experience and minimize risks. During the course of study, students will have the opportunity to earn N-REMT and other certifications. Offsite clinical lab opportunities with Fairfax County Fire and Rescue may be available to the students.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"911 Dispatcher",
         "description":"Emergency Medical Telecommunications is designed to develop entry-level skills needed in a telecommunication environment for rescue, fire, and police. The course provides the beginning telecommunicator with an understanding of situations encountered in an emergency communications environment. Upon completion, the student will be able to: summarize issues involving the telecommunicator's role and responsibilities as a member of health and public safety environment; summarize issues involving available resources to a telecommunicator; the importance of maintaining confidentiality, liability and legal issues involving emergency telecommunicators and their agencies; summarize the process of stress management for inside and outside a communications department/center.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Health Informatics",
         "description":"Health Informatics offers an overview of the field of health informatics by providing students with the fundamental knowledge of the concepts of health informatics and how technology can be used in the delivery of health care. Students are provided a broad exposure to the field of Health Informatics in topics including networking, information systems, security, and HIPAA. This is part of the Claude Moore Health Informatics Program.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Meidcal Assistant 1",
         "description":"This is part one (fall semester) of a two-part, full-year course. Students must also register for part two, Medical Assistant 2 for the spring semester. Medical Assistant 1 allows students to develop entry-level skills and techniques to increase their knowledge base so that they may enter the healthcare field. Some of these skills and knowledge base areas include administrative and clinical medical assisting. Field trips to a variety of health care settings may be available.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Medical Assistant 2",
         "description":"This is part two (spring semester) of a two-part, full-year course. Students must also register for part one, Medical Assistant 1 for the fall semester. Students further develop medical-assisting skills and techniques learned in Medical Assistant 1. They also learn management of patient records, cardiopulmonary resuscitation, care and use of equipment, collection and analysis of laboratory specimens, special diagnostic testing, basic diseases and disorders, basic knowledge of treatment and medication, and job preparedness skills. Advanced on-the-job clinical experience in a healthcare facility may be available as a part of the course. Successful completion of the program may lead to employment in physicians' offices or clinics. Students have the opportunity to earn Healthcare Provider CPR and NOCTI's medical assisting assessment. A potential to earn the Certified Clinical Medical Assistant (CCMA)credential may be available to students. Students must purchase uniforms and liability insurance and meet current health agency requirements to participate in clinical experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Pharmacy Technician 1",
         "description":"The Pharmacy Technician course incorporates both classroom and clinical lab pharmacy experiences. The student will be given the opportunity to meet state pharmacy technician competencies as well as be exposed to the larger arena of pharmacy careers. Students may have the opportunity to participate in a clinical experience. Students must purchase liability insurance and meet current health agency requirements to participate in clinical experiences. Students in this course are eligible to sit for the Virginia Pharmacy Technician Certification provided they have a Social Security Number or a control number issued by the Virginia Department of Motor Vehicles as required by the Virginia Board of Pharmacy.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Physical Therapy/occupational Therapy 1",
         "description":"This course is designed to provide an introduction to the professions of physical and occupational therapy. Students will explore the principles and practices of therapists in the healthcare industry and may participate in a clinical experience under the direct supervision of a licensed physical and/or occupational therapist. Clinical skills in the areas of physical therapy and occupational therapy will enable students to gain experience in rehabilitative care, which is practiced throughout the continuum of care and across the lifespan of individuals. After successful completion of this course, students will be prepared for employment as a rehabilitation technician or students may seek higher education for specific degrees in a variety of fields such as physical therapy, occupational therapy, speech therapy, sports medicine, athletic training, chiropractic medicine, biology, or exercise physiology.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Physical Therapy/occupational Therapy 2",
         "description":"Physical Therapy/Occupational Therapy 2 provides a more in-depth study of the topics covered in the first-level course with emphasis upon individual interests and strengths. Students will be able to select and participate in a clinical experience of their choice from a wide range of clinical settings serving diverse patient populations. The course work will focus on the advancement of problem-solving skills, hands-on techniques, and interpersonal skills with an introduction to clinical research. There will be a greater emphasis on musculoskeletal anatomy during the first two quarters of this course. This course is most appropriate for students anticipating employment or further studies in physical therapy, occupational therapy, or other related healthcare careers. Students must purchase scrubs and liability insurance and meet current health agency requirements to participate in clinical experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Practical Nursing 1",
         "description":"This is part one (fall semester) of a two-part, full-year course. Students must also register for part two, Practical Nursing 2 for the spring semester. 11th grade students who complete Practical Nursing 1 and 2 in their junior year will be eligible to enroll in the Patient Care Technician course during their 12th grade year. This course offers preclinical nursing instruction during the student's senior year of high school. Foundations of nursing including communication, anatomy and physiology, and medical math, are the main units of focus. Competency-based instruction provides students with the skills needed to provide basic bedside nursing care used for hospitalized, nursing home, and homebound patients. Following successful completion of Practical Nursing 1 and 2, students electing to enroll in the post-secondary clinical level participate in the summer clinical are eligible to take the Certified Nursing Assistant (CNA) exam. Classes are held at the Plum Center for Lifelong Learning while community healthcare agencies serve as sites for the practical application of the learned competencies. Students must purchase uniforms and liability insurance and meet current health agency requirements to participate in clinical experiences. Eligibility for acceptance into nursing program includes strong algebra and biology grades, attendance, and student statement/essay. Successful completion of the Practical Nursing 1 and 2 courses allows students to take a nine-month, full-time postgraduate clinical internship program. The postgraduate clinical internship curriculum enables students to demonstrate advanced nursing competencies. Students successfully completing the post-secondary course are eligible to sit for the Virginia Practical Nursing Licensing Exam (NCLEX) provided they have a Social Security Number or a control number issued by the Virginia Department of Motor Vehicles as required by the Virginia Board of Nursing.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Practical Nursing 2",
         "description":"This is part two (spring semester) of a two-part, full-year course. Students must also register for part one, Practical Nursing 1 for the fall semester. This course offers preclinical nursing instruction during the student's senior year of high school. Foundations of nursing including communication, anatomy and physiology, and introduction to pharmacology, are the main units of focus. Competency-based instruction provides students with the skills needed to provide basic bedside nursing care used for hospitalized, nursing home, and homebound patients. Following successful completion of Practical Nursing 1 and 2, students electing to enroll in the post-secondary clinical level participate in the summer clinical are eligible to take the Certified Nursing Assistant (CNA) exam. Classes are held at the Plum Center for Lifelong Learning while community healthcare agencies serve as sites for the practical application of the learned competencies. Students must purchase uniforms and liability insurance and meet current health agency requirements to participate in clinical experiences. Successful completion of the Practical Nursing 1 and 2 courses allows students to take a nine-month, full-time postgraduate clinical internship program. The postgraduate clinical internship curriculum enables students to demonstrate advanced nursing competencies. Students successfully completing the post-secondary course are eligible to sit for the Virginia Practical Nursing Licensing Exam (NCLEX) provided they have a Social Security Number or a control number issued by the Virginia Department of Motor Vehicles as required by the Virginia Board of Nursing.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Marketing 1",
         "description":"Students examine activities in marketing and business important for success in marketing employment and postsecondary education. Students will learn how products are developed, branded, and sold to businesses and consumers. Students will analyze industry trends and gain hands-on experience in the marketing of goods, services, and ideas. Topics will include professionalism in the workplace, product planning and positioning, promotion, pricing, selling, economic issues, and the impact of technology on the marketplace. This course reinforces mathematics, science, English, and history/social science Standards of Learning (SOL). Computer/technology applications and DECA activities enhance the course. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Marketing",
         "description":"Students build on knowledge gained in a prior Marketing course. Students participate in supervisory and management activities focusing on the marketing mix, purchasing, financing, human resources, global marketing, pricing, and emerging technologies. Students will prepare for advancement in marketing careers and postsecondary education. Classroom instruction will be reinforced through the use of case studies, guest lecturers, and field trips. This course reinforces mathematics, science, English, and history/social science Standards of Learning (SOL). Computer/technology applications and DECA activities enhance the course. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Sports And Entertainment Marketing",
         "description":"This introductory course helps students develop a thorough understanding of fundamental marketing concepts and theories as they relate to the sports, entertainment, and recreation industries. Students will investigate the components of branding, sponsorships and endorsements, as well as promotion plans needed for sports, entertainment and recreation events. The course also supports career development skills and explores career options. Academic skills (mathematics, science, English, and history/social science) related to the content are a part of this course. Classroom instruction will be reinforced through the use of outside lectures, case studies, and field trip experiences. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Fashion Marketing 1",
         "description":"In this specialized course, students gain basic knowledge of the apparel and accessories industry and skills necessary for successful employment in apparel businesses. Students develop general marketing skills necessary for successful employment in fashion marketing, general marketing skills applicable to the apparel and accessories industry, and specialized skills unique to fashion marketing. Personal selling, sales promotion, purchasing, physical distribution, market planning, and product/service technology as well as academic skills (mathematics, science, English, and history/social science) related to the content are part of this course. Computer/technology applications supporting this course are studied. Marketing simulations, case studies, projects, teamwork, guest speakers, and DECA activities provide many opportunities for application of instructional competencies. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Fashion Marketing 2",
         "description":"Students with a career interest in apparel and accessories marketing gain in-depth knowledge of the apparel and accessories industry and skills important for employment in apparel businesses. They develop advanced skills unique to fashion marketing and advanced general marketing skills applied to the apparel and accessories industry. Professional selling, sales promotion, buying, merchandising, marketing research, product/service technology, and supervision as well as academic skills (mathematics, science, English, and history/social science) related to the content are part of this course. Computer/technology applications supporting this course are studied. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year. (Students interested in this course should also see Fashion Design 1 under Family and Consumer Sciences.)",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Marketing Cooperative Internship (co-op)",
         "description":"The Marketing Cooperative Internship (Co-op) option enhances classroom instruction by providing practical work experience that is relevant to students' career goals. Students enrolled in Co-op attend at least one marketing or EFE class and work a minimum of 396 hours (10 hours per week) in an approved, supervised marketing-related, part-time job for one credit.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Marketing Cooperative Internship (co-op)",
         "description":"The Marketing Cooperative Internship (Co-op) option enhances classroom instruction by providing practical work experience that is relevant to students' career goals. Students enrolled in Co-op attend at least one marketing or EFE class and work a minimum of 720 hours (20 hours per week) in an approved, supervised marketing-related, part-time job for two credits.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Entrepreneurship 1",
         "description":"Entrepreneurship provides students opportunities for learning small business ownership skills. Students will experience the process of developing, financing, and marketing a new product or service through an interactive curriculum. Classroom instruction will be reinforced through the use of case studies, guest lecturers, and field trips. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Social Media Marketing",
         "description":"Students receive an introduction to marketing functions and study the Internet and Social Media marketing's role in the global economy. Students gain knowledge of the tools and technique used in Internet and Social Media marketing. They explore ethical, legal, and security aspects and prepare for a career in Internet and/or Social Media marketing. Academic skills (mathematics, science, English, and history/social science) related to the content are part of this course. Computer/technology applications supporting this course are studied. Classroom instruction will be reinforced through the use of outside lectures, case studies, and field trip experiences. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. Marketing Cooperative Internship is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Classroom-on-the-mall: Marketing Management",
         "description":"This specialized program enables students to learn business organization as well as operation skills and techniques in a realistic business setting. Classes are held in Fair Oaks shopping mall. Traditional classroom instruction in marketing, merchandising, fashion and management is enhanced by the opportunity for students to meet and work with professionals in the mall businesses. Students will develop critical-thinking and decision-making skills through the application of marketing principles to small and large businesses, nonprofit organizations, service industries, and other institutions or associations that make products or provide services. Students attend their base schools for regular classes and then travel to Fair Oaks shopping mall for both classroom instruction and related on-the-job training. The Holiday Gift Wrap Center and Prom Dress Shop offer additional opportunities for real-life entrepreneurial experiences. Due to the unique structure of this program, excellent attendance is mandatory. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. The cooperative education (Marketing Cooperative Internship) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Classroom-on-the-mall: Marketing Management 2",
         "description":"This specialized program enables students to learn business organization as well as operation skills and techniques in a realistic business setting. Classes are held in Fair Oaks shopping mall. Traditional classroom instruction in marketing, merchandising, fashion and management is enhanced by the opportunity for students to meet and work with professionals in the mall businesses. Students will develop critical-thinking and decision-making skills through the application of marketing principles to small and large businesses, nonprofit organizations, service industries, and other institutions or associations that make products or provide services. Students attend their base schools for regular classes and then travel to Fair Oaks shopping mall for both classroom instruction and related on-the-job training. The Holiday Gift Wrap Center and Prom Dress Shop offer additional opportunities for real-life entrepreneurial experiences. Due to the unique structure of this program, excellent attendance is mandatory. DECA, the co-curricular student organization, offers opportunities in leadership, community, and competitive events. The cooperative education (Marketing Cooperative Internship) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Education For Employment 1",
         "description":"This course teaches students to make informed career and continuing education choices as they transition from school, gain technical skills, and adapt to the workplace. Students are taught ethical behaviors and career-research, job acquisition, workplace-communication, self-awareness, self-advocacy, customer-service, and life skills. While enrolled in this course, the student will be an active member of a Career and Technical Student Organization (CTSO). The cooperative education (Education for Employment Cooperative Internship) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Education For Employment 2",
         "description":"This course continues to teach students to make informed career and continuing education choices as they transition from school, gain technical skills, and adapt to the workplace. Students are taught ethical behaviors and career-research, job acquisition, workplace-communication, self-awareness, self-advocacy, customer-service, and life skills. While enrolled in this course, the student will be an active member of a Career and Technical Student Organization (CTSO). The cooperative education (Education for Employment Cooperative Internship) method is available for this course. Students combine classroom instruction and supervised on-the-job training in an approved position with continuing supervision throughout the school year.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Basic Technical Drawing",
         "description":"Students develop basic skills in drawing and study careers related to drafting through the use of Computer-Assisted Drafting (CAD) and other software applications to gain an understanding of the technical drawing processes. This course is recommended for students interested in technical drawing, interior design, fashion design, decorating, construction, architecture, or engineering careers. 2D and 3D CAD certifications may be available.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:05",
            "-1:00/0:05",
            "-1:00/0:05",
            "-1:00/0:05",
            "-1:00/0:05",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Engineering Drawing",
         "description":"Students gain an understanding of technical drawing careers in modern industry. The course includes engineering-drafting problems, use of Computer-Assisted Drafting (CAD) equipment, and drafting skills and techniques. Students use Autodesk Inventor software and specifications along with other resource materials. Students interested in engineering or related careers will benefit from this course. 3D parametric modeling is introduced. Industry certification in Autodesk Inventor may be available.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Drawing",
         "description":"Students use a graphic language for product design and technical illustration. They increase their understanding of drawing techniques learned in the prerequisite courses. Students will research design-related fields while identifying the role of advanced drawing and design in manufacturing and construction industry processes. They apply the design process, analyze design solutions, reverse engineer products, create 3-D solid models using Computer-Assisted Drafting (CAD), construct physical models, and create multimedia presentations of finished designs. Students will complete a work portfolio based on a chosen graphic project using advanced software such as Autodesk Inventor, Revit and 3D Studio Max.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Design And Technology",
         "description":"Design and Technology is designed as a foundation high school course in technology education. Students use core technology knowledge to solve open-ended problems and create systems. Laboratory activities engage students in the design process through projects that integrate mathematics, science, and other core subjects. Working in groups, students build and control systems in the development of technology.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Geographic Information Systems 1",
         "description":"This course will introduce students to the theory, vocabulary, and concepts behind these and other applications of GIS, while providing students the opportunity to develop basic skills to apply GIS in a variety of contexts. Students will receive instruction in geographic information systems, global positioning systems, remote sensing, digital imaging processing simulator, Geodesy, automated cartography, land surveying, and navigation. Fundamentally, these technologies will enable students to explore and analyze the natural and human-made world, from local to global and beyond. Students will use various tools, processes, and techniques to create, store, access, manipulate, and revise data to solve human challenges. These experiences will employ real-world spatial analysis models and guidelines for integrating, interpreting, analyzing, and synthesizing data.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Stem Engineering",
         "description":"For students interested in engineering, this course builds a solid foundation to move forward in the Science, Technology, Engineering and Math (STEM) curriculum. Students are introduced conceptually and analytically to the primary concepts in the four classic engineering disciplines civil, mechanical, electrical, and aerospace engineering. Students will explore and develop problem based learning projects in these areas while working as real world collaborative teams. By applying STEM concepts to design problems students will dramatically improve their use of mathematics, computer simulations, scientific analysis, oral and written skills during this course. This course provides for orientation to the careers and challenges of engineering. Students are actively involved with high-tech devices, engineering graphics, and mathematics/scientific principles through problem-solving and critical thinking experiences. Students integrate mathematics, science, and technical writing with technology instruction to solve engineering-based problems.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Stem Advanced Engineering",
         "description":"This advanced level engineering course emphasizes student knowledge and application of engineering problem-solving through research and development concepts. It focuses on current and emerging technologies. Students learn to work in collaborative engineering teams and solve group design and projects. Students are challenged to solve problems using design, mathematics, computer simulations, scientific analysis, and oral and written skills. Engineering is studied with a focus on modeling, systems, optimization, technology-society interaction, design, and engineering ethics. Projects may be models, systems, or products that creatively solve an engineering problem. This course is the capstone course in the engineering sequence to prepare students for college or engineering careers.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Stem Robotics Systems 1",
         "description":"This course provides an orientation to careers in various fields of manufacturing. Emphasis will be placed on manufacturing systems, safety, materials, production, business concepts, and the manufacturing process. Students participate in individual and team activities to create products that demonstrate critical elements of manufacturing.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Engineering Mathematics",
         "description":"The mathematics topics taught in this course are motivated through direct applications in engineering. Engineering Mathematics addresses salient mathematics topics actually used in the primary core engineering college courses; Basic Algebraic Manipulations; Trigonometry; 2-D Vectors; Complex Numbers; Sinusoids and Harmonic Signals; Systems of Equations and Matrices; Basics of Differentiation; Basics of Integration; Linear Differential Equations with Constant Coefficients. Course material is taught through hands-on physical experiments in the classroom and laboratory, and is thoroughly integrated with the engineering analysis software MATLAB. Students learn the interconnection between classroom theory, laboratory measurement and numerical representation of their engineering results.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Engineering Physics",
         "description":"This course may be used to satisfy one credit toward the science, elective, fine arts, or career and technical education requirement of the standard or advanced studies diploma. The course is the second year of the two-year college preparatory, laboratory-based Engineering Physics sequence; and is designed for students anticipating careers in the physical sciences, engineering, technology, medicine, or other research, and experimentation disciplines. The course begins with a review of mathematical and basic physics and engineering concepts to assure that all students are brought to a consistent level of preparedness. Curriculum topics include universal concepts, inquiry processes, fundamental constants, special relativity, rotational dynamics, waves and vibrations, energy conversion, transducers, electromagnetic radiation, optical measurements, and exponential behavior. These topics are addressed in the context of mechanical, fluid, electrical, thermal, and aerospace systems. Students complete approximately 50 hours of laboratory experimentation and participation in advanced technology competitions. The course may include curriculum-related field trips and college-oriented information seminars. Individual academies apply the curriculum in the manner that best fits local facilities and opportunities. Participating students may compete for a limited number of industry internships.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Automotive Technology 1",
         "description":"Students will study and define the eight major systems of the automobile, related tools and equipment, and the automotive industry. An emphasis will be placed on diagnosing systems, developing troubleshooting skills, and the safe use of laboratory equipment. Curriculum is developed from the National Automotive Technicians Education Foundation (NATEF) task lists. Major topics include engine performance, brakes, electrical and electronic systems, and suspension and steering systems. In addition, students will be tested on NATEF criteria.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Automotive Technology 2",
         "description":"Students will study and define the eight major systems of the automobile, related tools and equipment, and the automotive industry. An emphasis will be placed on diagnosing systems, developing troubleshooting skills, and the safe use of laboratory equipment. Curriculum is developed from the National Automotive Technicians Education Foundation (NATEF) task lists. Major topics include engine performance, brakes, electrical and electronic systems, and suspension and steering systems. In addition, students will be tested on NATEF criteria. As an option, many students may have an opportunity to participate in local internship experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Automovile Collision Service 1",
         "description":"Students are introduced to skill sets derived from industry standards in the auto body repair and restoration industry. The curriculum and laboratory activities are defined by I-CAR and the National Automotive Technicians Education Foundation (NATEF) and include panel repairs, painting, frame and unibody construction, steering, suspension, detailing, and welding. In addition, students are exposed to the theoretical and practical aspects of this career.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Automotive Collision Service 2",
         "description":"Students will refine existing skills and develop specific skills necessary to repair late-model damaged vehicles to their original condition. The curriculum and laboratory practices are defined by I-CAR and the National Automotive Technicians Education Foundation (NATEF) and include the following: refinishing, metalworking, welding, frame-strengthening systems, unibody measuring principles, structural repair, steering, suspension, mechanical, and electrical repairs. As an option, many students may have an opportunity to participate in local internship experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Small Engine Repair",
         "description":"Students will receive advanced instruction and experiences in the areas of small engine repair, small engine maintenance, welding, servicing, and repair of lawnmowers, rotary tillers, and portable power equipment. Topics will range from lifecycle, economics, and funding. An emphasis will be placed on entrepreneurship and project management. Student internship experiences are an option for this course.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Carpentery 1",
         "description":"Students will have an opportunity to study and learn about a $700 billion industry providing a variety of employment opportunities. An emphasis will be focused on construction safety, OSHA regulations, mathematics applications, and craft knowledge. In addition to a variety of hands-on experiences, students will be introduced to electricity, framing, plumbing, millwork, and problem solving activities related to the construction industry. Students will become proficient in identifying types of residential construction components to form foundations and frame walls, floors, ceilings, roofs, doors, and windows. Curriculum is developed by the National Association of Home Builders (NAHB).",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Carpentry 2",
         "description":"Students will receive advanced instruction and experiences in the areas of layout and design, framing, estimating, purchasing, planning, and installing. Topics will range from residential through commercial construction. An emphasis will be placed on entrepreneurship and construction site management using curriculum developed by the National Association of Home Builders (NAHB). Students will become proficient in assembling and installing various types of residential construction components that are current with industry standards, including rigging and job-estimating procedures, forming foundations, framing floors, walls, ceiling, roofs, trusses, roofing materials, stairs, exterior doors and windows, decks, and porches. Student internship experiences are an option for this course.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Construction Tech 1",
         "description":"Through a partnership with the Foundation of Applied Technical Education, Inc. (FATE), students have an opportunity to build a single-family home in Springfield, Virginia. This specialized course curriculum is developed by the National Association of Home Builders (NAHB). All aspects of new home construction will be addressed during the course. Students will work directly on concrete installation, framing, ceramic tile, kitchen installation, bathroom installations, hardwood floors, electrical, plumbing, HVAC, landscape, and other areas of new home construction. Theoretical and physical aspects of the construction industry are explored in order for students to establish career goals in the industry.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Construction Tech 1",
         "description":"Through a partnership with the Foundation of Applied Technical Education, Inc. (FATE), students have an opportunity to build a single-family home in Springfield, Virginia. This specialized course curriculum is developed by the National Association of Home Builders (NAHB). All aspects of new home construction will be addressed during the course. Students will work directly on concrete installation, framing, ceramic tile, kitchen installation, bathroom installations, hardwood floors, electrical, plumbing, HVAC, landscape, and other areas of new home construction. Theoretical and physical aspects of the construction industry are explored in order for students to establish career goals in the industry.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Construction Tech 2",
         "description":"Through a partnership with the Foundation of Applied Technical Education, Inc. (FATE), students have an opportunity to build a single-family home in Springfield, Virginia. This specialized course curriculum is developed by the National Association of Home Builders (NAHB). All aspects of new home construction will be addressed during the course. Students will work directly on concrete installation, framing, ceramic tile, kitchen installation, bathroom installations, hardwood floors, electrical, plumbing, HVAC, landscape, and other areas of new home construction. Theoretical and physical aspects of the construction industry are explored in order for students to establish career goals in the industry.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Cosmetology 1",
         "description":"In this introductory course, students study hair, skin, and nails and their related care. Students are grounded in theory as they prepare to practice procedures in a clinical lab setting or classroom, using manikins for manipulative skill practice. The first-year course emphasizes personal safety, professionalism, and sanitation and disinfection of equipment and facilities. Students develop skills in shampooing and conditioning hair, as well as styling and cutting hair. Students learn about the characteristics of hair, product selection, and basic elements that determine hair growth, health, and appearance. In addition to up-to-date skills in hair styling and cutting, permanent waving, coloring, scalp and facial treatment, and manicuring, students will begin licensure preparation as prescribed by the Virginia Board of Cosmetology.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Cosmetology 2",
         "description":"In this continuing course, students build on their theoretical foundation of general sciences and practices in cosmetology to increase proficiency in haircutting and styling with attention to professionalism, client consultation, safety, and infection control. Students are trained in safe chemical processes related to permanent waves, relaxers, lightening, and coloring hair. In addition, students learn to care for skin, hands, and feet, developing experience in providing facials, manicures, pedicures, and nail enhancements. Students use a laboratory setting for the study of skin, hair, nails and cosmetic chemistry. Through laboratory experiences, students will develop advanced skills and knowledge in all phases of salon industry. Students complete the required cosmetology competencies determined by the Virginia Board of Cosmetology in preparation for the Virginia Cosmetology State Board Exam to qualify as a licensed cosmetologist. Students in this course will have the opportunity to take the Virginia Cosmetology State Board Exam provided they have a social security number or a control number issued by the Virginia Department of Motor Vehicles as required by the Virginia Board of Cosmetology.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Criminal Justice 1",
         "description":"This course is designed for students who are considering a career in criminal justice. The course prepares students for career opportunities within the criminal justice system as well as entrance into institutions of higher learning. Specific areas of training will be provided in criminal law and investigation, security training, communications, emergency response, crimes, search and seizures, arrests, crime prevention, court procedure, and police operations. The program is structured to give students a strong academic background with the skills and knowledge necessary to meet the needs of a career in any of the cited fields. In addition, experts from various agencies provide in-depth information and experiences.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Criminal Justice 2",
         "description":"This course is an in-depth study of crime in America, United States' courts in action, and law enforcement efforts to deal with crime. The course will look into victimization, due process, and Constitutional laws affecting law enforcement as well as a review of sentencing offenders, parole, prison rehabilitation, and corrections of the 1990s. Included will be a view of other employment careers in private and mechanical security systems as well as local, state, and federal law enforcement. A major component of level 2 will include the work-experience component, i.e., shadowing, mentorship, etc.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Electrical Construction And Engineering 1",
         "description":"Laboratory work and academic studies include AC/DC circuit analysis, designing and construction switching circuits, fixture specifications and installations, computing and fabricating residential electrical services, and other wiring exercises as required by residential wiring systems. Theory and the national electric code are taught as they apply to the lesson topic. Students learn to install, relocate, troubleshoot, and repair copper twisted pair network cabling.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Electrical Construction And Engineering 2",
         "description":"Further study of electrical wiring and power distribution techniques is offered, including direct- and alternating-current machines, such as motors and generators, and magnetic controls and transformers in both single- and two- or three-phase systems. National Electrical Codes, as well as state and power company policies pertaining to electrical power distribution, are studied. Major appliance repair is also taught. Student internship experiences are an option for this course.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Heating, Ventilation, Air Conditioning, And Refrigeration 1",
         "description":"In the first year of the heating, ventilation and air conditioning (HVAC) program students will learn to use a variety of hand tools including wrenches, pliers, screwdrivers, hammers as well as specially tools of the HVAC trade which include digital multimeters, thermometers, scales, vacuum pumps and refrigerant recovery equipment. Students will complete projects utilizing copper tubing, PVC and black iron pipe with ACR tubing cutters, flaring, swaging and threading tools. Students will also master the use of various types of torches for soldering and brazing and build a basic mechanical refrigeration cycle. Students will also learn the concepts of electricity and complete a series of electrical projects and also be introduced to the sheet metal arts.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Heating, Ventilation, Air Conditioning, And Refrigeration 2",
         "description":"Students continuing their education of the HVAC program in the second year which focuses on the installation, maintenance, troubleshooting service and repair of a central air conditioning system as well as a gas furnace, oil furnace and heat pump systems. Students will also learn about weatherization and energy efficiency of HVAC equipment and ductwork as well as understanding various types of motors used in HVAC equipment. During the second year focus is also given to the Environmental Protection Agency's Section 608 refrigerant handling certification with the goal of passing the Core section plus one or more types in either small appliances, high or low pressure systems earning them an industry credential. Student internship experiences are an option for this course.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Photography Studio 1",
         "description":"In a state-of-the art digital photography lab/studio, students use the latest digital cameras on both the PC and Mac platforms. Students will photograph people, places, and objects and will prepare these images with the intent of professional publication using software such as Adobe Photoshop, Illustrator, InDesign, and Acrobat. The course allows the students to see dynamic results in real time and to print their work on professional level color printers. Topics include image composition, digital editing, studio and location lighting, file formats, file maintenance and storage, and print production. Students will relate these skills to the current business and art practices of the modern commercial photographic industry. In addition, students will develop personal portfolios to aid in entry into the marketplace or advanced photography educational program.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Photography Studio 2",
         "description":"This course provides students with experience needed to begin a career in commercial photography as well as an in-depth view of digital photography and related industries. Students will develop studio lighting techniques and composition skills in this project-oriented course. Creativity, imagination, and innovation are qualities that will be exercised by using high-end digital cameras and sophisticated imagery and production software such as Adobe Photoshop, Adobe Illustrator, InDesign, and Acrobat. Students will relate these skills to the current practices of art and business in the modern commercial photographic industry. A component of this course is dedicated to learning how to open and maintain a professional photography studio. Students will work independently, as well as collaboratively, toward the completion of class projects. Students will develop personal portfolios to aid in entry into the marketplace or advanced photography educational program.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Television Production 1",
         "description":"This curriculum is designed to train students for a career in, or entry into a collegiate program involving the television and film production industries. Film, Video, and Multimedia terminology, technique, and theory will be discussed. State-of-the-art, video equipment is used by the students in this class. Students will learn to operate professional video cameras and field equipment for productions outside of the classroom, and professional studio cameras, audio equipment, special effect generators, and character generators for use in the fully outfitted studio. With parental permission, equipment may be checked out and used for on-location shoots. Students learn post-production skills on cutting edge non-linear editing equipment, and finalize their projects to DVD. Toward the end of the first year, students may be presented with internship and professional work opportunities.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Television Production 2",
         "description":"Students continue to build a foundation of knowledge and skills through hands-on experience operating professional television production equipment in the field and studio as described in Television Production 1. Students are expected to take advantage of numerous internship opportunities that are available for 2nd year students. New learning opportunities include the ability to specialize in any of several dozen areas of interest with regards to pre-production, production, and post-production.",
         "superCategory":"Classes",
         "category":"cte",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"English 11",
         "description":"Students read and analyze a variety of literary and nonfiction texts, comparing themes of various works and analyzing expository materials to make inferences and draw conclusions. To further their media literacy, students evaluate sources to determine authors purpose and intended effect. Language study extends students' vocabulary through applying understanding of connotations, denotations, word origins, and structures. Students apply their understanding of grammar, capitalization, punctuation, spelling, sentence structure, and paragraphing to varied and frequent writing assignments. With an emphasis on persuasive writing, students apply their skills and adapt content, vocabulary, voice, and tone to a specific audience and purpose. In the research process, students analyze, evaluate, synthesize, and organize information from a variety of sources to produce a research product. They also refine their oral communication skills through gathering and organizing evidence to support a position in informative and persuasive presentations.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:08",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"English 11 Honors",
         "description":"Students build expertise in their analysis of literary and non-literary texts and apply persuasive techniques to craft written and oral communication. Throughout the course, students engage in deep analysis of the ways authors make stylistic choices to create specific effect as they examine the ways literature helps make sense of the American experience. In nonfiction texts, students analyze patterns of rhetoric and organization to determine how rhetorical devices function to inform and persuade an audience. In addition to texts, students analyze and evaluate media messages to examine how the media strategically influences beliefs and behaviors. Through these varied, authentic texts, students build a sophisticated vocabulary by applying their knowledge of connotations, denotations, word origins, and structures. With an emphasis on persuasion, students apply their understanding of rhetoric to craft independent arguments in oral presentations and writing that reflect personal communication style appropriate to the audience and purpose. They also engage in the research process to generate new understandings or solve problems through the synthesis of information on a variety of topics.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement English Language And Composition",
         "description":"Students study prose analysis and advanced composition at a level equivalent to that of a full-year introductory college course. With an emphasis on nonfiction, students read and analyze texts from a variety of eras and styles to develop skills in recognizing rhetorical context, author's purpose, and the use of the strategies of language. In refining their awareness of language and the writer's craft, students apply purposeful rhetorical strategies to their writing, and compose for a variety of purposes. Students who complete this course are required to take the Advanced Placement examination in English Language and Composition, and may earn college credit if a qualifying score is achieved. Completion of this course fulfills the English 11 course requirement.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Literacy Essentials",
         "description":"This course is designed to provide direct, explicit and intensive reading and writing instruction to students who are two or more years below expected proficiency. Basic objectives of this course are focused on closing the gap between the students present level of performance and the level of performance needed to successfully access the general curriculum.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Literacy Lab 2",
         "description":"Literacy LAB (Literacy Access Bridge) 2 provides focused intervention of reading and writing skills as well as English content included in the English 9 and 10 Program of Studies that are necessary to pass the EOC English: Reading and/or Writing SOL tests, which students take in English 11. Successful completion of this course counts as a sequential elective when taken after Literacy LAB 1 or Developing Literacies.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Literacy Lab 3",
         "description":"Literacy LAB (Literacy Access Bridge) 3 provides focused intervention of reading and writing skills as well as English content included in the English 11 Program of Studies that are necessary to pass the EOC English: Reading and/or Writing SOL tests. Successful completion of this course counts as a sequential elective when taken after Developing Literacies, Expanding Literacies 1, Literacy LAB 1 or Literacy LAB 2.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Journalism 1",
         "description":"In Journalism 1, students learn the history and language of journalism; develop communication skills in writing, designing and editing for a variety of media; understand news and the process of publication; and become more critical readers and consumers of mass media. This course prepares students for continued study in journalism, photojournalism, and broadcast journalism.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Journalism 2",
         "description":"In Journalism 2, students learn and apply techniques of layout, design, and desktop publishing. Students develop a more sophisticated level of journalistic writing and participate in the operation and production of the high school newspaper and/or student-produced website. Students also learn skills in business and circulation management.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Journalism 3",
         "description":"In addition to enhancing their skills as reporters, students in Journalism 3 learn the role of editorial leadership, develop a personal sense of professionalism, understand the role of the newspaper in society, and become productive members of the newspaper and/or student-produced website staff. Students also learn skills in business and circulation management.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photojournalism 1",
         "description":"In Photojournalism 1, students learn the principles of interviewing, copywriting, photography, layout, and design. Students use publishing software to create pages for the school's yearbook.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photojournalism 2",
         "description":"In Photojournalism 2, students develop their copywriting skills and advance their photography and design skills as they create pages for the school's yearbook. They may also become section editors.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photojournalism 3",
         "description":"In Photojournalism 3, students refine their copywriting skills and advance their computer and photography skills, develop individual style, and may assume leadership roles as members of the yearbook staff's editorial board.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Creative Writing 1",
         "description":"This course provides students an opportunity for additional writing instruction beyond the standard English program. Experimentation with many forms of writing is encouraged, with an emphasis on poetry, fiction plays, and other forms of descriptive writing. Students continue to expand and refine their ability to write through analyzing and evaluating their own writing and that of other students.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:15",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Advnaced Composition 1",
         "description":"This course provides students an in-depth study of writing in the academic disciplines. Students improve their writing through intense word study, critical reading, and analytical thinking. Students expand and refine their ability to write through analyzing and evaluating their own writing and that of others.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Composition 2",
         "description":"This course provides students the opportunity for further exploration of academic writing. Students hone their writing skills by further analyzing published texts and attempting more advanced work while also collaborating with other students on revision and critique.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Debate",
         "description":"The debate course is designed to develop students' creative and critical thinking, research, speaking, listening, and argumentation skills. Students engage in mock trials, Model Congress, and Policy Debate.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Forensics",
         "description":"Forensics provides students with an opportunity to practice and develop proficiency in oral communication techniques. Students sharpen their skills in a chosen area of concentration such as oral interpretation, extemporaneous speaking, or original oratory. Students are encouraged to use their skills in speech competition or performance.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Film Study",
         "description":"Throughout the course, students analyze the techniques filmmakers use to create visual stories in a variety of films from different time periods, genres, and cultures. In addition, students apply their film analysis skills to produce original works.",
         "superCategory":"Classes",
         "category":"english",
         "times":[
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"English Lang Dev (level 1)",
         "description":"English learners develop their English language proficiency and English literacy skills through a balanced literacy approach. Students engage in tasks that support academic language development in the four domainsreading, writing, listening and speaking. Ongoing formal and informal assessment data are used to appropriate place and transition students through the levels of the ELD courses. This course is aligned to the WIDA English language development (ELD) standards and the grade-level English standards of learning.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"English Lang Dev (level 2)",
         "description":"English learners develop their English language proficiency and English literacy skills through a balanced literacy approach. Students engage in tasks that support academic language development in the four domainsreading, writing, listening and speaking. Ongoing formal and informal assessment data are used to appropriate place and transition students through the levels of the ELD courses. This course is aligned to the WIDA English language development (ELD) standards and the grade-level English standards of learning.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"English Lang Dev (level 3)",
         "description":"English learners develop their English language proficiency and English literacy skills through a balanced literacy approach. Students engage in tasks that support academic language development in the four domainsreading, writing, listening and speaking. Ongoing formal and informal assessment data are used to appropriate place and transition students through the levels of the ELD courses. This course is aligned to the WIDA English language development (ELD) standards and the grade-level English standards of learning.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"English Lang Dev (level 4)",
         "description":"This course is taken concurrently with Transitional English 9 or English 9. ESOL and English teachers work together to provide a comprehensive program based on the FCPS English 9 POS. Students read a variety of literature and relate life situations to literary themes. They continue to develop their reading and writing skills and study the structure of the English language through an integrated language arts curriculum. Students refine their listening and speaking skills through class discussions and oral presentations. This course may be repeated for elective credit.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Esol Individual Math Double Block",
         "description":"The course is designed for WIDA ELP Level 1 & 2 students with significant gaps in mathematics to support the development of the mathematics and language skills necessary for success in Algebra 1. Over the period of one year meeting daily, students examine algebra- and geometry-preparatory concepts and skills; strategies for collecting, analyzing, and interpreting data; and number concepts and skills emphasizing proportional reasoning. Problem solving, communication, concept representation, and connections among mathematical ideas are presented in a hands-on learning environment. Students may need up to two years to complete the course, but should move to the next course as soon as their mathematics skills warrant. This course emphasizes language objectives in addition to mathematics objectives and does not meet the mathematics graduation requirements; students earn elective credit.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Strategies For Success For English Learners",
         "description":"This elective course is designed to provide support English Learners in core curricular areas and to provide direct instruction in specific learning strategies, study skills, time management, organization, and self-advocacy skills to develop the habits necessary for academic success. Students will gain skills in personal development and socio-emotional awareness skills. In addition, this course will teach strategies to enhance English language development in the four language domains of reading, writing, listening and speaking. Students will participate in building a strong classroom and school community through class meetings and intercultural communication. Students who successfully complete the course will earn an elective credit. Students successfully completing two years of this course will satisfy the sequential elective requirement for the Standard Diploma.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Literacy Essentials",
         "description":"This course is designed to provide direct, explicit and intensive reading instruction to English Learners with an English Language Proficiency (ELP) level 1 who have significant gaps in their home language instruction and literacy. With the goal to equip students for success in core classes, instruction will focus on the essential components of reading which include phonemic awareness, phonics, reading fluency (including oral skills), vocabulary development and reading comprehension strategies through engaging student centered learning. Due to the targeted and foundational nature of the reading course, student placement in this course is dependent upon assessment outcomes as well as information gathered and reviewed through a SIFE Consultation. Students placed in Developmental Reading may defer enrollment in English 9 for ELs if appropriate for a period of one year while enrolled in this class. Parents must be informed of this placement decision, and a meeting with the parents is recommended to review the student data and student needs.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Strategies For Success For English Learners",
         "description":"This elective course is designed to provide support English Learners in core curricular areas and to provide direct instruction in specific learning strategies, study skills, time management, organization, and self-advocacy skills to develop the habits necessary for academic success. Students will gain skills in personal development and socio-emotional awareness skills. In addition, this course will teach strategies to enhance English language development in the four language domains of reading, writing, listening and speaking. Students will participate in building a strong classroom and school community through class meetings and intercultural communication. Students who successfully complete the course will earn an elective credit. Students successfully completing two years of this course will satisfy the sequential elective requirement for the Standard Diploma.",
         "superCategory":"Classes",
         "category":"esol",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Academy Dance 1",
         "description":"Students will develop fundamental skills in dance through movement, placement, alignment, and technique for selected dance forms which may include ballet, jazz, modern, tap, and social dances. . Students will cultivate dance vocabulary, study dance history, and develop improvisational and performance skills. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Academy Dance 2",
         "description":"Students will develop proficiency in dance through movement, alignment, technique, flexibility and strength. Students will broaden and accrue knowledge in dance history, vocabulary, criticism, anatomy, kinesiology, theory and composition. Students will explore concepts and employ skills in choreography, improvisation and performance. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Academy Dance 3",
         "description":"Students will build on skills learned in Dance 2 and continue pedagogy in movement, alignment, technique, flexibility and strength. Students will deepen and accrue knowledge in dance history, vocabulary, criticism, anatomy, kinesiology, theory and composition. Students will apply concepts and skills in choreography, improvisation and performance. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Hip Hop Dance",
         "description":"This high-energy introductory course will focus on the foundations and origins of Hip-Hop dance culture including street, commercial and freestyle forms. Students will be encouraged to step outside of the box by bringing their own individual style and personality to movements. Students will be challenged and encouraged to understand and apply historical and practical knowledge of Hip-Hop through class activities and performances. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Broadway Theatre Dance",
         "description":"This introductory course is designed to offer instruction in techniques of Broadway dance. Students will study movement in a variety of theatrical styles such as jazz and tap. Students will also increase their knowledge of Broadways most high-profile choreographers and their famous works. Students will gain the ability to apply dance technique and learn to express musicality in a physical way through class activities and performances.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Beginning Band",
         "description":"Students develop skills as individual musicians and as members of a musical group. Guidance will be given by the instructor in the selection of an instrument. Course content includes beginning level technical and ensemble skills necessary for performance. Some performance opportunities are provided. Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Concert Band",
         "description":"Students continue developing as individual musicians and as members of a musical group. Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance. Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Intermediate Band Level 2",
         "description":"Students continue developing as individual musicians and as members of a musical group. Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance. Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Intermediate Band Level 3",
         "description":"Students continue developing as individual musicians and as members of a musical group. Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance. Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Band",
         "description":"Students in this course form the representative performing band for the school. Emphasis is placed on the sequential development of advanced technical skills and on the study of related literature. Based on successful completion of sequential concepts for each level, students will continue to learn advanced musical concepts. Marching band techniques, rehearsals, and performances are required in this course. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Percussion Ensemble",
         "description":"The percussion ensemble class is designed to meet specific needs of percussionists. Content includes study of the appropriate ensemble literature, and rehearsal and performance techniques from the various areas of musical composition. Instrumentation of the group is at the discretion of the instructor. Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Beginning Orchestra",
         "description":"Students develop skills as individual musicians and as members of a musical group. Guidance will be given by the instructor in the selection of an instrument. Course content includes beginning level technical and ensemble skills necessary for performance. Some performance opportunities are provided. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Intermediate Orchestra",
         "description":"Students continue developing as individual musicians and as members of a musical group. Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:13",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advnaced Orchestra Level 1",
         "description":"Students in this course form the representative string performing group for the school. Emphasis is placed on the sequential development of advanced technical, ensemble, and disciplinary skills necessary for refined rehearsal and performance both in and out of school. Based on successful completion of sequential concepts for each level, students will continue to learn advanced musical concepts., students will continue as specified in course level. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Orchestra Level 2",
         "description":"Students continue developing as individual musicians and as members of a musical group. Emphasis is placed on the development of advanced level technical and ensemble skills necessary for performance. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Orchestra Level 3",
         "description":"Students in this course form the representative string performing group for the school. Emphasis is placed on the sequential development of advanced technical, ensemble, and disciplinary skills necessary for refined rehearsal and performance both in and out of school. Based on successful completion of sequential concepts for each level, students will continue as specified in the course. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Treble Chorus",
         "description":"Students will participate in a chorus of higher voices with an emphasis on correct vocal performance techniques. Based on successful completion of sequential concepts, students will continue to learn progressive musical concepts and build sight-singing through the study of appropriate choral literature. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Basso Chorus",
         "description":"Students will participate in a chorus of lower voices with an emphasis on correct vocal performance techniques. Based on successful completion of sequential concepts, students will continue to learn progressive musical concepts and build sight-singing through the study of appropriate choral literature. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Intermediate Treble Chorus",
         "description":"Students will participate in an intermediate level of higher voices and continue to study correct vocal production, sight-singing, and development of musicianship through appropriate choral literature. Based on successful completion of sequential concepts for each level, students will continue as specified in the course. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Mixed Chorus",
         "description":"Students are offered advanced choral experiences for mixed voices. Emphasis is placed on the development of musicianship and proficiency in ensemble performance. Course content includes a study of choral literature, vocal techniques, and sight-singing. Based on successful completion of sequential concepts for each level, students will continue to learn advanced musical concepts.. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advnaced Treble Chorus Women",
         "description":"Students are offered advanced choral experiences for higher voices. Emphasis is placed on the development of musicianship and proficiency in ensemble performance. Course content includes a study of choral literature, vocal techniques, and sight-singing. Based on successful completion of sequential concepts for each level, students will continue as specified in the course Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Basso Chorus",
         "description":"Students are offered advanced choral experiences for lower voices. Emphasis is placed on the development of musicianship and proficiency in ensemble performance. Course content includes a study of choral literature, vocal techniques, and sight-singing. Based on successful completion of sequential concepts for each level, students will continue as specified in the course Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Music Sampler",
         "description":"Students are provided the opportunity to sample a variety of musical experiences in a non-performing music class. Course content includes beginning guitar and class piano experience, as well as various modules designed to assist students in developing music reading and composing skills. Selected composers and musical compositions will be studied as a part of this course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Music Theory",
         "description":"Emphasis is placed on developing and understanding basic music theory skills. Course content includes recognizing and notating: all major and minor scales, rhythms in simple and compound meters, and triadic chord structures. Composition skills in standard notation of simple melodies, with accompanying chords and keyboard performance of simple tunes, may also be included. Students will become acquainted with appropriate musical terms.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:10",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Guitar 1",
         "description":"Students learn the fundamentals of guitar. Guitar instruction emphasizes basic technique, reading, progressions, and music theory. Instructional literature is selected from classical and contemporary repertoire. Guest artists and field trips to performances and/or seminars may also be part of the curriculum.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Guitar 2",
         "description":"Students continue to develop skills on the guitar. Guitar instruction emphasizes intermediate technique, reading, progressions, and music theory. Instructional literature is selected from classical and contemporary repertoire. Guest artists and field trips to performances and/or seminars may also be part of the curriculum.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Guitar 3",
         "description":"Students continue to develop skills on the guitar. Guitar instruction emphasizes advanced technique, reading, progressions, and music theory. Instructional literature is selected from classical and contemporary repertoire. Guest artists and field trips to performances and/or seminars may also be part of the curriculum.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Guitar Ensemble",
         "description":"Students in this course form one of the representative performing guitar ensembles for the school. Emphasis is placed on the sequential development of advanced technical skills and on the study of related literature. Based on successful completion of sequential concepts for each level, students will continue as specified in course level. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Music And Computer Technology 1",
         "description":"Students will explore the use of computers and other electronic technologies in music including: Musical Instrumental Digital Interface (MIDI), analog and digital synthesis, sequencing, acoustics, sound processing, and electronic musical composition using the latest music industry software and the internet. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Musical Theatre And Actor's Studio 1",
         "description":"Students will study advanced performance techniques specific to both classic and modern American musical theatre including acting, body/stage movement, and singing technique. Students will explore the history of musical theatre as well as current topics related to auditioning and resume development. Students will participate in school-based performances that may be in conjunction with students from an advanced technical theatre course. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Musical Theatre And Actor's Studio 2",
         "description":"Students will continue to study advanced performance techniques specific to both classic and modern American musical theatre including acting, body/stage movement, and singing technique. Students will continue to explore the history of musical theatre as well as current topics related to auditioning and resume development. Students will participate in school-based performances that may be in conjunction with students from an advanced technical theatre course. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Theatre Arts 1",
         "description":"Theatre Arts 1 is a foundations course that introduces students to dramatic literature, theatre history, technical theatre, artistic leadership, and acting. This course provides opportunities for students to experience and participate in the creative processes of performance and production. This course emphasizes skill development and provides theatrical opportunities that enable students to determine personal areas of interest. Participation in co-curricular activities and performances may be required to receive credit for this course.. This course may be used to satisfy the graduation requirement for a credit in fine l arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Theatre Arts 2",
         "description":"Theatre Arts 2 integrates and builds upon concepts and skills from Theatre Arts 1. Through various modes of expression and performance, students explore dramatic literature, theatrical styles, and historical periods. Students will study and respond to a variety of theatre experiences that will refine their communicative, collaborative, analytical, interpretive, and problem solving skills. Students will expand their artistic abilities and appreciation of theatre arts. . Participation in co-curricular activities and performances may be required to receive credit for this course. This course may be used to satisfy the graduation requirement for a credit in fine arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Theatre Arts 3",
         "description":"Students exhibit independence, discipline, and commitment to the theatrical process through their work on assigned projects. Advanced work in script analysis, character interpretation, and performance skills are expected. Collaboration with actors and directors is augmented by special assignments and opportunities. . Participation in co-curricular activities and performances may be required to receive credit for this course. This course may be used to satisfy the graduation requirement for a credit in fine arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Technical Theatre 1",
         "description":"Students explore various areas of technical theatre such as lighting, costumes, sound, scenery, makeup, properties, and theatre management. An analysis of dramatic literature leads students to an understanding of the design and production process. Participation in co-curricular activities and productions may be required to receive credit for this course. This course may be used to satisfy the graduation requirement for a credit in fine arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Technical Theatre 2",
         "description":"Students apply technical theatre knowledge and skills by participating in a variety of theatre lab activities and practical projects. Emphasis is on script interpretation and execution of the design concept. Students will collaborate to effectively and safely create functional scenery, properties, lighting, sound, costumes and makeup, and to develop stage management, business and public relations skills. Participation in co-curricular activities and productions may be required to receive credit for this course. This course may be used to satisfy the graduation requirement for a credit in fine arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Technical Theatre 3",
         "description":"Students exhibit independence, discipline, and commitment to the theatre process through their work on assigned projects. Advanced work in technical elements of production is augmented by special assignments and opportunities. Participation in co-curricular activities and productions may be required to receive credit for this course. This course may be used to satisfy the graduation requirement for a credit in fine arts.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Professional Musical Heatre And Actor's Studio 1",
         "description":"Students will study advanced performance techniques specific to both classic and modern American musical theatre including acting, body/stage movement, and singing technique. Students will explore the history of musical theatre as well as current topics related to auditioning and resume development. Students will participate in school-based performances that may be in conjunction with students from an advanced technical theatre course. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Musical Theatre And Actor's Studio 2",
         "description":"Students will study advanced performance techniques specific to both classic and modern American musical theatre including acting, body/stage movement, and singing technique. Students will explore the history of musical theatre as well as current topics related to auditioning and resume development. Students will participate in school-based performances that may be in conjunction with students from an advanced technical theatre course. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Professional Musical Theatre And Actor's Studio 2",
         "description":"Students will continue to study advanced performance techniques specific to both classic and modern American musical theatre including acting, body/stage movement, and singing technique. Students will continue to explore the history of musical theatre as well as current topics related to auditioning and resume development. Students will participate in school-based performances that may be in conjunction with students from an advanced technical theatre course. For more information, visit the academy web site.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Studio Art And Design 1",
         "description":"Explore a variety of exciting opportunities and materials to inform the artmaking process. Learn to think conceptually and realize potential as a creative and critical thinker in order to meet the challenges of 21st century living. Explore personal interests while developing skills in the areas of drawing, painting, printmaking, ceramics, sculpture, and digital media. Course content includes art production, art appreciation, and studies in visual culture.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Studio Art And Design 2",
         "description":"Cultivate previously developed artistic knowledge and skills learned in Studio Art and Design 1. Explore new combinations and possibilities in the use of two-dimensional and three-dimensional media including technological applications. Investigate contemporary topics as they relate to artistic expression and design. Ask questions, solve problems, create products, and communicate ideas in innovative ways. Course content includes art production, design thinking, art history, criticism, aesthetics, and studies in visual culture.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Studio Art And Design 3",
         "description":"Expand and improve artistic understandings and skills by using creative processes. Develop an individual style and voice to communicate ideas. Articulate responses to personal and global issues through the integration of traditional and electronic media. Present artworks in diverse formats. Course content includes art production, design application, art history, criticism, aesthetics, and studies in visual culture.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Digital Art And Design 1",
         "description":"Think creatively and solve visual problems to create personally expressive, original artworks using technology. Develop expertise in the use of computers, scanners, and digital cameras for artmaking. Use Adobe Photoshop, Adobe Illustrator, Bryce 3-D, and Adobe Flash in the areas of motion graphics/animation, graphic design, and digital imaging. Learn to address ethical issues concerning computer generated imagery. No prior computer experience is required.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Digital Art And Design 2",
         "description":"Expand knowledge in the application of computer hardware and software to create personally expressive, original art. Solve complex visual problems within the areas of multimedia presentations, motion graphics/animation, graphic design, and digital imaging using Adobe Photoshop, Adobe Illustrator, Bryce 3-D, and Adobe Flash. Prepare a final required portfolio for evaluation.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Digital Art And Design 3",
         "description":"Expand knowledge and ability in the application of hardware and software to create personally expressive, original art. Create visual solutions using a variety of media, including motion graphics/animation, graphic design, game development, web design and print design. A final portfolio or demo reel is required for evaluation.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photography 1",
         "description":"Explore and practice standard black and white photographic processes through the use of cameras, films, light effects, and the application of basic darkroom techniques. Explore and practice digital photographic processes. Produce meaningful photographs that express ideas about experiences and observations of the world. Study the history of photography and the work of well known photographers to inform artmaking. Develop a beginning portfolio.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photography 2",
         "description":"Expand on the study of black and white photography and digital processes. Acquire and apply in-depth knowledge of photographic equipment, films, and specialized processes to include digital applications. Investigate leading exponents, equipment, and techniques from an historical perspective. Learn to critique and evaluate personal artwork and photographic works of others. Examine photography and its relationship to other art forms. Prepare a portfolio of meaningful artworks that demonstrate expressive content and quality of craftsmanship.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Photography 3",
         "description":"Develop a personal voice that integrates an in-depth exploration of film and digital processes. Explore various career paths in photography such as Photojournalism, Commercial and Fine Art Photography. Apply professional exhibition techniques to present own work. Develop a quality portfolio that effectively illustrates a personal voice.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Animation",
         "description":"Learn to use 2-D and 3-D computer software to create animation. Create personally expressive animations and communicate visually in effective ways through the use of modeling, story and character development, and lifelike motion. Become familiar with animation related careers such as game design, animation, film and television special effects.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Visual Communications 1",
         "description":"Develop and apply techniques in visual communication through the use of traditional and electronic media. Create original artworks for a variety of intended purposes such as personal, commercial, informational, social, cultural and environmental. Develop an understanding of ways in which artists communicate meaningful ideas for a specific purpose or intent. Become familiar with ethical issues related to the field of visual communications. Maintain a traditional and non-traditional sketchbook in addition to compiling a beginning visual communications portfolio.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Visual Communications 2",
         "description":"Create original works that express depth of thought and complex ideas through visual communication. Use a variety of 2-D, 3-D, and 4-D traditional and electronic media to communicate ideas related to personal, commercial, informational, social, political, cultural, spiritual, or environmental issues. Work with design components, consider technical aspects and focus on ways to interact with the viewer in communication of ideas. Maximize creative approaches and take into account the parameters of a client-driven environment. Conduct oral presentations and critiques and compile a required portfolio based on evidence of content, design quality, and technical skill. Address ethical issues related to the field of visual communications.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Visual Communication 3: Portfolio Preparation",
         "description":"Refine technical skills and develop a personal style in an advanced study of visual communications. Exhibit initiative, commitment, and an openness to new approaches and conduct an in-depth exploration of a specific idea or theme. Consider aesthetics and issues related to the influence of mass media and visual culture in the development of personal artistic style, and use of symbolism and content. Compile a required final portfolio evidencing effective content, quality, concentration, and breadth of experience. Arrange and present an exhibition of personal artwork. Address ethical issues related to the field of visual communications.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Advanced Placement Art: Drawing Portfolio",
         "description":"This course is designed for highly motivated, advanced art students who have demonstrated a serious interest in the study of art. Ideally suited for students who work well independently, the course will focus on the preparation of a drawing portfolio of artworks that exhibit quality, concentration in an area of visual interest or problem solving, and breadth of experience in the formal, technical, and expressive means of an artist. The drawing portfolio addresses a broad interpretation of drawing issues including painting, printmaking, studies for sculpture, some forms of design, and abstract and observational works. Students will prepare and submit drawing portfolios based on objectives that reflect the format and requirements established by the College Board for Advanced Placement Studio Art. Advanced Placement college credit and/or placement may be awarded if a qualifying exam score is achieved. All students are required to take Advanced Placement Art: Studio Art Drawing exam.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Art: 2-d Design Portfolio",
         "description":"This course is designed for highly motivated, advanced art students who have demonstrated a serious interest in the study of art. Ideally suited for students who work well independently, the course will focus on the preparation of a two-dimensional design portfolio of artworks that exhibit quality, concentration in an area of visual interest or problem solving, and breadth of experience in the formal, technical, and expressive means of an artist. The two-dimensional portfolio may include, but is not limited to, forms of artwork in graphic design, typography, digital imaging, photography, collage, fabric design, weaving, illustration, painting, and printmaking. Students will submit two-dimensional portfolios based on objectives that reflect the format and requirements established by the College Board for Advanced Placement Studio Art. Advanced Placement college credit and/or placement may be awarded if a qualifying exam score is achieved. All students are required to take the Advanced Placement Art: 2-D Design exam.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"3-d Studio Art 1",
         "description":"Develop skills and techniques in the use of materials and equipment to create three-dimensional artworks that may include sculpture, ceramics, architecture, and other three-dimensional art forms. Experiment with a variety of three-dimensional media to improve skills and refine craftsmanship and express ideas in innovative ways. Maintain a required portfolio of personal artwork.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"3-d Studio Art 2",
         "description":"Acquire and apply in-depth knowledge of three-dimensional processes to create original artworks that may include sculpture, ceramics, architecture, and other three-dimensional art forms. Study historical and cultural styles and leading artists of three-dimensional art forms to inform the artmaking process. Analyze personal artworks and the work of others through critique and evaluation and apply professional exhibition techniques to arrange a display of selected artworks. Compile a culminating portfolio evidencing expressive content, quality, concentration, and breadth of experience.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"3-d Studio Art 3: Portfolio Preparation",
         "description":"Engage in advanced study of three-dimensional studio art processes, aesthetics, and criticism. Use advanced level three-dimensional materials and equipment to produce meaningful artworks that exhibit technical proficiency and personal style. Communicate ideas in unique and innovative ways and demonstrate initiative and commitment to the pursuit of artistic expression. Organize and present an exhibition of personal artworks. Compile a body of work in a final portfolio.",
         "superCategory":"Classes",
         "category":"fine arts",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Economics And Personal Finance",
         "description":"Instruction in economics and personal finance prepares students to function effectively as consumers, savers, investors, entrepreneurs, and active citizens. Students learn how economies and markets operate and how the United States' economy is interconnected with the global economy. On a personal level, students learn that their own human capital (knowledge and skills) is their most valuable resource. Beginning with students entering ninth grade in fall 2011, one standard unit of credit in Economics and Personal Finance is required for graduation. Students who choose an EPF option that requires payment, will not be reimbursed should additional options become available.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/00:10",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Independent Study",
         "description":"This course will support students in the development of knowledge and skills that foster postsecondary readiness. Students will engage in research and project-based learning of their own choosing with the support of the instructor. Students will be responsible for developing a plan with timelines, checkpoints, and criteria for evaluating their progress throughout the year, culminating in a capstone project and/or presentation. Students will need to submit both form IS-165, Request to Enroll in an Independent Study Course for Elective Credit, and IS-166, Academic Plan for Independent Study for Elective Credit, for approval prior to starting the course.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Economics And Personal Finance De",
         "description":"This course provides the opportunity for students to earn credit for Economics 110 and 120 (Consumer Economics and Survey of Economics) through Northern Virginia Community college. During the first semester, students enroll in Economics 110 to gain an understanding of the American economic system, their role as a consumer and how to apply the principles of economic analysis to practical problems encountered in everyday life. During second semester, students enroll in Economics 120 to extend their understanding of the workings of the American economic systems. To enroll in this course, students must meet the college's admission criteria and pay tuition for the course. For more information about dual enrollment courses, visit FCPS.edu and search for dual enrollment.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Strategies For Success",
         "description":"This elective course is designed to provide support to a student in core curricular areas and to provide direct instruction in specific learning strategies, study skills, time management, organization, and self-advocacy skills. Time is also allotted to address individual areas of need. While students may receive assistance on core curricular assignments, the course is not designed to serve as a study hall. Students enrolled in the course receive the equivalent of one period of instruction each day and earn an elective credit. This course may be taught for an elective credit all four years or more, as appropriate. Students successfully completing two years of this course will satisfy the sequential elective requirement for the Advanced or Standard Diploma.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Leadership Training 1",
         "description":"This course provides leadership training to interested students. It is especially appropriate for student body officers, organizational leaders, and class officers. The course includes understanding leadership, assessment of leadership styles, planning and organization skills, relationship building and problem solving. Focus will be placed on organization, time management, election processes, financial planning, opinion surveys, communication techniques, and becoming a community liaison. Student government and class activities will be the basis around which most of the course work is designed.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Computer Technology Assistance",
         "description":"Computer Technology Assistance is an elective course open to students who have a fundamental level of computer hardware and software knowledge. Students will learn advanced level concepts of computer architecture, computer operating systems, network concepts, software maintenance, and advanced computer troubleshooting techniques as they apply their knowledge to the maintenance and support of computers within the school. Students will maintain a weekly journal of their learning experiences that will serve as documentation for potential employment opportunities.",
         "superCategory":"Classes",
         "category":"general",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Adapted Physical Education",
         "description":"The adapted physical education elective course builds on the knowledge and skills acquired in 9th and 10th grade and is designed for students who have IEPs indicating adapted physical education services in a special education setting. Students gain knowledge and skills in a variety of team sports/activities and participate in individualized personal fitness plans to promote an active lifestyle. Activities are designed for the students present level of performance and directed to improve deficit areas and maximize participation. NOTE: This course is not required for students who have completed 9th and 10th grade health and physical education and enrollment should be determined by IEP teams.",
         "superCategory":"Classes",
         "category":"health and p/e",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Advanced Physical Education Level 1",
         "description":"Students continue to learn and master and/or refine lifetime sports activities with emphasis on health and sports related fitness, as they relate to attainment of a healthy lifestyle. Students may elect this course in grade 11 or grade 12. Students may not take this course in lieu of Health and Physical Education grade 9 or grade 10 course requirements.",
         "superCategory":"Classes",
         "category":"health and p/e",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Personal Fitness - Level 1",
         "description":"Students study and apply concepts related to human anatomy and physiology, kinesiology, nutrition, and personal fitness planning. Students will develop and participate in a personal fitness program to improve cardiorespiratory endurance, flexibility, muscular strength and endurance, and body composition. Students may not take this course in lieu of the grade 9 or grade 10 Health and Physical Education requirements.",
         "superCategory":"Classes",
         "category":"health and p/e",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Personal Fitness - Level 2",
         "description":"Students extend and enrich their knowledge and the application of human anatomy and physiology, kinesiology, nutrition, and personal fitness planning. Students will develop and participate in a personal fitness program to improve cardiorespiratory endurance, flexibility, muscular strength and endurance, and body composition. Students will utilize concepts to assess, plan, monitor, and modify their individual personal fitness plan. Students may not take this course in lieu of the grade 9 or grade 10 Health and Physical Education requirements.",
         "superCategory":"Classes",
         "category":"health and p/e",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Sports Medicine",
         "description":"Students will study and apply concepts related to medical professions, anatomy and physiology of skeletal and muscular systems, kinesiology, types of injuries, injury prevention and nutrition. Students may not take this course in lieu of the grade 9 or grade 10 Health or Physical Education requirements.",
         "superCategory":"Classes",
         "category":"health and p/e",
         "times":[
            "-1:00/0:10",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"American Sign Language 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in signing, receiving signs and non-manual gestures, and reading. Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life. This course may be counted as a world languages course in fulfilling requirements for the Advanced Studies Diploma.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"American Sign Language 2",
         "description":"Students continue to develop proficiency in American Sign Language. They learn to function in real-life situations using more complex language structures and a wider range of vocabulary. Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel. This course may be counted as a world languages course in fulfilling requirements for the Advanced Studies Diploma.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"American Sign Language 3",
         "description":"Students continue to develop and refine their proficiency in American Sign Language. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students add vocabulary and idiomatic expressions in the context of everyday interactions and social relationships. Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities. This course may be counted as a world languages course in fulfilling requirements for the Advanced Studies Diploma.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"American Sign Language 4",
         "description":"Students continue to develop and refine their proficiency in American Sign Language. They communicate using complex language structures on a variety of topics, moving from concrete to abstract concepts. At this level, students add vocabulary and idiomatic expressions in the context of everyday interactions and social relationships. Students begin to explore the world of interpretation. Students gain a deeper understanding of the world around them while studying Deaf Culture, Globalization and Communication, Science, and Social Issues.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Arabic 1",
         "description":"In this electronic classroom course, students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life. Schools must have a facilitator on hand to proctor tests, ensure students are on task, and forward information to the instructor. Schools must provide adequate study area for distance learning students.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Arabic 2",
         "description":"In this electronic classroom course, students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel. Schools must have a facilitator on hand to proctor tests, ensure students are on task, and forward information to the instructor. Schools must provide adequate study area for distance learning students.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Arabic 3",
         "description":"In this electronic classroom course, students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities. Schools must have a facilitator on hand to proctor tests, ensure students are on task, and forward information to the instructor. Schools must provide adequate study area for distance learning students.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"French 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"French 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"French 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"French 4",
         "description":"Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement French Language",
         "description":"The purpose of this course is to prepare students to take the Advanced Placement Language examination given each spring, for which placement and/or credit may be awarded at the college level if a qualifying score is obtained. Students study the use of language for active communication. Specifically, they understand the spoken target language in both formal and conversational situations. They express ideas accurately and resourcefully, both orally and in writing, with reasonable fluency, and they develop a vocabulary sufficiently ample for reading newspaper and magazine articles, contemporary literature, and other nontechnical writings. They receive extensive training in the organization and writing of compositions, review syntax, and study selected works by contemporary authors. Materials will include recordings, films, newspapers, and magazines. All students are required to take the Advanced Placement French Language exam.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"German 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"German 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"German 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"German 4",
         "description":"Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advance Placement German Language",
         "description":"The purpose of this course is to prepare students to take the Advanced Placement Language examination given each spring, for which placement and/or credit may be awarded at the college level if a qualifying score is obtained. Students study the use of language for active communication. Specifically, they understand the spoken target language in both formal and conversational situations. They express ideas accurately and resourcefully, both orally and in writing, with reasonable fluency, and they develop a vocabulary sufficiently ample for reading newspaper and magazine articles, contemporary literature, and other nontechnical writings. They receive extensive training in the organization and writing of compositions, review syntax, and study selected works by contemporary authors. Materials will include recordings, films, newspapers, and magazines. All students are required to take the Advanced Placement German Language exam.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Latin 1",
         "description":"Students learn basic language structures and essential elements of Latin pronunciation in order to be able to read simple passages in Latin. The relationship of English to Latin is emphasized in vocabulary building, word derivation, and meanings of prefixes and suffixes. Language structures and syntax are developed through the study of literary passages. The geography, history, government and the culture of the Roman Empire are studied. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirements of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Latin 2",
         "description":"Students learn additional vocabulary, more complex language structures and syntax in order to be able to read more challenging passages in Latin. Language structures and syntax are developed through the study of literary passages. Students continue to explore as they study Roman life and Rome's contribution to our civilization.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Latin 3",
         "description":"Students continue to develop and refine their reading skills through the study of Latin literature. Additional vocabulary, more complex language structures and syntax are emphasized in order to be able to read the writings of prose authors. Through translation and interpretation, students gain a greater understanding of the foundation of Western government and civilization.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Latin 4",
         "description":"Students continue to develop and refine their reading skills through the study of Latin literature. Students read Vergil's Aeneid silently for comprehension and orally for poetic meter and analyze the various passages for content, connotation of words and author's style. Students study the life and times of Vergil, his influence on later writers, his poetic devices, and his Aeneid as a literary work.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Latin 5",
         "description":"Students continue their study of Latin prose and/or poetry, improving their reading proficiency as they deepen their understanding of more complex syntax. Analysis of the Latin texts as literature is emphasized. Students also develop a greater appreciation of the social and political context in which the various works were written as well as their influence upon later literature.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Latin",
         "description":"The purpose of this course is to prepare students to take the Advanced Placement examination, for which placement and/or credit may be awarded at the college level if a qualifying score is obtained. Students study the literary techniques used by Roman authors by reading Latin poetry and prose with historical and literary sensitivity. Students are encouraged to develop linguistic skills by engaging in multiple activities, including translating poetry and prose from the required-reading list, precisely and literally; reading passages of poetry and prose with comprehension; and analyzing literary texts in clear, coherent written arguments, supported by textual examples. All students are required to take the Advanced Placement Latin exam.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Italian 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grad point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Italian 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time and Vacation and Travel.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Italian 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills  listening, speaking, reading and writing  with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Spanish 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirements of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Spanish 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Spanish 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Spanish 4",
         "description":"Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Spanish 5",
         "description":"Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved. Students express abstract ideas while discussing literature, history, and current events.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advance Placement Spanish Language",
         "description":"The purpose of this course is to prepare students to take the Advanced Placement Language examination given each spring, for which placement and/or credit may be awarded at the college level if a qualifying score is obtained. Students study the use of language for active communication. Specifically, they understand the spoken target language in both formal and conversational situations. They express ideas accurately and resourcefully, both orally and in writing, with reasonable fluency, and they develop a vocabulary sufficiently ample for reading newspaper and magazine articles, contemporary literature, and other nontechnical writings. They receive extensive training in the organization and writing of compositions, review syntax, and study selected works by contemporary authors. Materials will include recordings, films, newspapers, and magazines. All students are required to take the Advanced Placement Spanish Language exam.v",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Spanish Literature",
         "description":"The purpose of this course is to prepare students to take the Advanced Placement Literature Examination, for which placement and/or credit may be awarded at the college level if a qualifying score is achieved. Students increase their proficiency in the basic language skills and learn to analyze prose and verse passages designated in the College Board syllabus. All students are required to take the Advanced Placement Literature exam.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Arabic 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life. For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma. It also counts toward the total number of credits required for graduation.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Arabic 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Arabic 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Chinese 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life. This course is only offered at Fairfax Academy and Marshall Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Chinese 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel. This course is only offered at Fairfax Academy and Marshall Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Chinese 3",
         "description":"Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities. This course is only offered at the Marshall Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Chinese 4",
         "description":"Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics. This course is only offered at the Marshall Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Korean 1",
         "description":"Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures. This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing. Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life. The implementation of this course is contingent upon an enrollment of 25 students. This course is only offered at the Fairfax Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Korean 2",
         "description":"Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing. They learn to function in real-life situations using more complex sentences and language structures. They read material on familiar topics and produce short writing samples. Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel. The implementation of this course is contingent upon an enrollment of 25 students. This course is only offered at the Fairfax Academy.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Korean 3",
         "description":"During this fall semester course students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing. They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts. At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar. Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities. The implementation of this course is contingent upon an enrollment of 25 students. This course is only offered at the Fairfax Academy. Students who sign up for Korean 3 in the fall semester must take Korean 4 in the spring semester.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Korean 4",
         "description":"During this spring semester course students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics. The implementation of this course is contingent upon an enrollment of 25 students. This course is only offered at the Fairfax Academy. Students who sign up for Korean 4 in the spring semester must have taken Korean 3 in the fall semester.",
         "superCategory":"Classes",
         "category":"languages",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Algebra 1",
         "description":"This course extends students' knowledge and understanding of the real number system and its properties through the study of variables, expressions, equations, inequalities, and analysis of data derived from real-world phenomena. Emphasis is placed on making connections in algebra to geometry and statistics. Calculators and computer technologies are integral tools. Graphing calculators are an essential tool for every student to explore graphical, numerical, and symbolic relationships.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Geometry Part 1",
         "description":"Students develop an understanding of the reasoning process and the concept of proof. Properties and relationships of lines, angles, and triangles are developed inductively and then verified deductively. Topics include conditional statements, syllogisms, points in space, parallel lines, transversals, planes, congruence, the Pythagorean Theorem, and similarity. Calculators, computers, graphing utilities, dynamic geometry software, and other appropriate technology tools will be used to assist in teaching and learning. This course includes an integrated review of algebraic topics needed in geometry. Students who began 9th grade during the 2009-2010 school year or earlier must pass Geometry to receive mathematics graduation credit for Geometry / Part 1. This course will not count towards a mathematics graduation credit for students who start 9th grade during the 2010-2011 school year or later.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Geometry Part 2",
         "description":"Students investigate properties of quadrilaterals, other polygons, circles, and three-dimensional figures using inductive and deductive reasoning. Topics include area, perimeter, symmetry, reflections, rotations, translations, arc length, circumference, secants, tangents, volume, polyhedra, and surface area. Calculators, computers, graphing utilities, dynamic geometry software, and other appropriate technology tools will be used to assist in teaching and learning. This course includes a review of the Geometry / Part 1 topics needed for the Geometry SOL test.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Geometry",
         "description":"This course emphasizes two- and three-dimensional reasoning skills, coordinate and transformational geometry, and the use of geometric models to solve problems. A variety of applications and some general problem-solving techniques, including algebraic skills, will be used to explore geometric relationships. Conjectures about properties and relationships are developed inductively and then verified deductively. Calculators, computers, graphing utilities, dynamic geometry software, and other appropriate technology tools will be used to assist in teaching and learning.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:20",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Algebra 2",
         "description":"Algebra 2 provides a thorough treatment of algebraic concepts through the study of functions, polynomials, rational expressions, complex numbers, exponential and logarithmic equations, arithmetic and geometric sequences and series, and data analysis. Emphasis is placed on the mechanics of algebra with real world applications and modeling. A transformational approach to graphing is used with families of related graphs. Numerical, graphical, and algebraic solutions are considered for all problems as applicable. Graphing utilities, especially graphing calculators, are integral to the course.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Algebra 2 Honors",
         "description":"The depth and level of understanding expected in Algebra 2 Honors is beyond the scope of Algebra 2. Students are expected not only to master algebraic mechanics but also to understand the underlying theory and to apply the concepts to real-world situations in a meaningful way. A thorough treatment of advanced algebraic concepts is provided through the study of functions, polynomials, rational expressions, complex numbers, matrices, exponential and logarithmic equations, infinite geometric sequences and series, permutations and combinations, data analysis, and selected topics in discrete mathematics. Emphasis is on modeling, logic, and interpretation of results. A transformational approach to graphing is used with families of related graphs. Numerical, graphical, and algebraic solutions are considered for all problems, as applicable. Graphing utilities, especially graphing calculators, are integral to the course.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Computer Science",
         "description":"Students develop detailed knowledge of the fundamental structure of a computer system, with emphasis on problem solving and structured programming. Skills in defining, writing, and running programs on a computer are developed through an individual approach that allows the student to work with both mathematical and non-mathematical problems. Java will be the primary programming language.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:10",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:07",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Precalculus With Trigonometry",
         "description":"Precalculus with Trigonometry includes all the topics of Trigonometry (3150) and a thorough treatment of functions through the study of polynomials, rational functions, logarithmic, exponential, and inverse functions. Topics include continuity, maximum and minimum points, an intuitive approach to limits, and rates of change. A transformational approach to graphing is used with families of related graphs. Numerical, graphical, and algebraic solutions are considered for all problems as applicable. Emphasis will be placed on problem solving techniques. Graphing utilities, especially graphing calculators, are integral to the course.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:20",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:17",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Precalculus With Trigonometry Honors",
         "description":"The depth and level of understanding expected in Precalculus with Trigonometry Honors is beyond the scope of Precalculus with Trigonometry. Precalculus with Trigonometry Honors includes all of the topics of Trigonometry (3150) and an in-depth treatment of functions through the study of polynomials, transformations, rational functions, exponential and logarithmic functions, inverses, polar equations, parametric equations, two-dimensional vectors, and selected topics in discrete mathematics. The course also includes the study of limits, continuity, maximum and minimum points and values, definition and properties of the derivative, rules of differentiation, equations of tangent lines to polynomial functions, infinite limits, and partial fractions. Numerical, graphical, and algebraic solutions are considered for all problems as applicable. Graphing utilities, especially graphing calculators, are integral to the course.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:25",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Trigonometry",
         "description":"Trigonometry topics include circular functions, right triangle ratios, solving trigonometric equations, inverses, identities, the Laws of Sines and Cosines, graphing trigonometric functions, and applying trigonometric techniques to solving real-world problems. A transformational approach to graphing is used with families of related graphs. Numerical, graphical, and algebraic solutions are considered for all problems as applicable. Graphing utilities, especially graphing calculators, are integral to the course.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Discrete Mathematics",
         "description":"Discrete mathematics requires problem-solving strategies be applied to real-world application, develops verbal and written skills in the process of problem-solving, and promotes mathematical connections across disciplines. Course content includes management science, the mathematics of apportionment, matrix operations and applications, recursion, and discrete applications in the natural and social world. The course also includes theory of probability, description of statistical measurements, probability distributions, and statistical inference.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Discrete Mathematics Semester Course",
         "description":"Discrete mathematics requires problem-solving strategies be applied to real-world application, develops verbal and written skills in the process of problem-solving, and promotes mathematical connections across disciplines. Course content includes management science, the mathematics of apportionment, matrix operations and applications, recursion, and other discrete applications in the natural and social sciences.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Probability And Statistics",
         "description":"Probability and Statistics is an activity-based introduction to statistics that emphasizes working with data, graphs, and statistical ideas including the use of statistical software. Students are expected to develop and present professional quality statistical analyses. Course content includes theory of probability, description of statistical measurements, sampling and experimental design, probability distributions, and statistical inference.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Probability And Statistics Semester Course",
         "description":"Probability and Statistics is an activity-based introduction to statistics that emphasizes working with data, graphs, and statistical ideas including the use of statistical software. Course content includes theory of probability, description of statistical measurements, probability distributions, and statistical inference. Optional topics include statistical inference involving two populations, linear regression, and correlation.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Statistics",
         "description":"Advanced Placement Statistics includes graphical and numerical techniques to study patterns and explore data, strategies for developing a plan to conduct a study based on data analysis, probability as a tool for predicting distribution of data, and techniques of statistical inference. Students who successfully complete this course and the AP statistics examination may receive credit and/or advanced placement for a one-semester college statistics course. Content of this course corresponds to the syllabus of the College Board Advanced Placement Statistics Program. All students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Computer Science A",
         "description":"The purpose of this course is to prepare students for the Advanced Placement Computer Science A examination, for which college credit and/or placement may be given, if a qualifying score is achieved. Content of this college-level course corresponds to the syllabus of the College Board Advanced Placement Program for Computer Science A. Students will design software to solve problems and use data structures, such as classes and arrays, to represent information within a program. Students will also gain a working knowledge of the major hardware and software components of computer systems. Java is the primary programming language for implementing solutions to problems. All students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Computer Science Ab",
         "description":"This is an advanced course in Computer Science for students looking to continue the study of programming beyond Computer Science or AP Computer Science A. The major emphases in this course are programming methodology, algorithms, and data structures. Applications of computing are used to develop students' awareness of particular algorithms and data structures to provide topics for programming assignments in which students can apply their knowledge. Java is the vehicle for implementing solutions to problems.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Calculus Ab",
         "description":"This course emphasizes a multi-representational approach to calculus. Concepts, results, and problems are expressed graphically, numerically, analytically, and verbally. Content includes concepts and applications of differential and integral calculus, limits, and elementary differential equations. This course prepares students for the Calculus AB Advanced Placement examination, for which placement and/or credit may be awarded at the college level, if a qualifying score is obtained. Content of this college-level course corresponds to the syllabus of the College Board Calculus AB Advanced Placement Program. All students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:25",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:22",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Calculus Bc",
         "description":"This course is an extension of Advanced Placement Calculus AB. This course emphasizes a multi-representational approach to calculus. Concepts, results, and problems are expressed graphically, numerically, analytically, and verbally. Content includes concepts and applications of differential and integral calculus, sequences and series, and elementary differential equations. This course prepares students for the Calculus BC Advanced Placement examination, for which placement and/or credit may be awarded at the college level, if a qualifying score is obtained. Content of this college-level course corresponds to the syllabus of the College Board Calculus BC Advanced Placement Program. All students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Multivariable Calculus",
         "description":"A third semester college-level course, Multivariable calculus is the calculus of three dimensions and includes the study of partial differentiation, multiple integrals, and line integrals. This course will receive a weighted grade and may be taken for college credit for a fee through a dual-enrollment agreement with George Mason University.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:45",
				"-1:00/0:41",
				"-1:00/0:41",
				"-1:00/0:41",
				"-1:00/0:41",
				"-1:00/0:41",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Matrix Algebra",
         "description":"This college-level course includes the study of systems of linear equations, vector spaces, linear dependence, linear transformations and matrix representation, orthogonal reduction, determinants, eigenvectors and eigenvalues, and a variety of applications. This course will receive a weighted grade and may be taken for college credit for a fee through a dual-enrollment agreement with George Mason University.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Algebra 2 Strategies",
         "description":"This course is designed for students enrolled in Algebra 2 who would benefit from extended work building foundational Algebra skills. Students will explore the mathematics process goals in-depth while building algebraic proficiencies. The materials in this course support the core curriculum instructed in Algebra 2. Algebra 2 strategies is to be taken concurrently with Algebra 2.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Engineering Mathematics",
         "description":"The mathematics topics taught in this course are motivated through direct applications in engineering. Engineering Mathematics addresses salient mathematics topics actually used in the primary core engineering college courses; Basic Algebraic Manipulations; Trigonometry; 2-D Vectors; Complex Numbers; Sinusoids and Harmonic Signals; Systems of Equations and Matrices; Basics of Differentiation; Basics of Integration; Linear Differential Equations with Constant Coefficients. Course material is taught through hands-on physical experiments in the classroom and laboratory, and is thoroughly integrated with the engineering analysis software MATLAB. Students learn the interconnection between classroom theory, laboratory measurement and numerical representation of their engineering results.",
         "superCategory":"Classes",
         "category":"mathematics",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Biology 1",
         "description":"In Biology 1, students engage in scientific inquiry through lab work as they explore biological processes. All class and laboratory activities focus on life processes that occur within organisms or cells as well as the characteristics of life including: reproduction, development, and adaptation to environment. Major topics of study include molecular biology, cells, genetics, organisms, evolution and ecology. If dissections are a part of the laboratory experience, alternatives are available.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/0:09",
            "-1:00/0:09",
            "-1:00/0:09",
            "-1:00/0:09",
            "-1:00/0:07",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Biology 1 Honors",
         "description":"In Biology 1 Honors, students engage in scientific inquiry as they explore biological processes. All class activities and laboratory activities focus on life processes that occur within organisms or cells as well as the characteristics of life including: reproduction, development, and adaptation to environment. Major topics of study include molecular biology, cells, genetics, organisms, evolution and ecology. In comparison to Biology 1, students will investigate some topics at a deeper level including biotechnology, health and environmental issues. Students, either independently or in teams will participate in an externally-moderated experimental/research project. If dissections are a part of the laboratory experience, alternatives are available.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:10",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Chemistry 1",
         "description":"Chemistry 1 provides students the opportunity to develop their critical thinking skills as they acquire a better understanding of the chemical nature of our world. Students investigate the composition, properties, and reactions of matter. The approach is inductive, mathematical, and conceptual. Laboratory experiments and subsequent classroom analysis are integral components of the course.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Chemistry 1 Honors",
         "description":"Chemistry 1 Honors provides students the opportunity to utilize their strong critical thinking skills and apply their mathematical knowledge as they investigate in depth the composition, properties, and reactions of matter. Laboratory experiments and subsequent classroom analysis are integral components of the course. Students, either independently or in teams, will participate in an externally-moderated experimental/research project.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Geosystems",
         "description":"Geosystems utilizes content from geology, astronomy, oceanography, and meteorology to investigate, both qualitatively and quantitatively, the major earth systems (atmosphere, hydrosphere, lithosphere, biosphere) and their dynamic inter-relationships. Students explore concepts with the same tools professional scientists use including computers, Geographic Information Systems (GIS), Global Positioning System (GPS), image processing software, and probeware.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Geosystems Honors",
         "description":"Geosystems Honors utilizes content from geology, astronomy, oceanography, and meteorology to investigate, both qualitatively and quantitatively, the major earth systems (atmosphere, hydrosphere, lithosphere, biosphere) and their dynamic inter-relationships. Students explore concepts with the same tools professional scientists use including computers, Geographic Information Systems (GIS), Global Positioning System (GPS), image processing software, and probeware. Students will investigate some topics at a deeper level and will participate in an externally-moderated experimental/research project either independently or in teams.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Active Physics",
         "description":"Active Physics is a physics course for students who have not yet passed Algebra I or were weak in Algebra I during the previous school year. This course has a strong emphasis on experimentation. The units of study focus on predictions and real-world applications such as sports, medicine, transportation, home, and communication. The physics content is presented in a problem solving manner to strengthen both science and mathematics content knowledge and skills.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Physics 1",
         "description":"Physics 1 introduces the central concepts of physics, including kinematics, dynamics, the conservation laws (mass, energy, and momentum), electricity, magnetism, and waves. This laboratory-centered course utilizes an approach that is inductive and mathematical as well as conceptual.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Physics 1 Honors",
         "description":"Physics 1 Honors introduces the most central concepts of physics, including the dual wave-particle nature of light, kinematics, dynamics, the conservation laws (mass, energy, and momentum), electricity, magnetism, and waves. This course is laboratory-centered and employs the methods of scientific inquiry. Students, either independently or in teams, will be involved in an externally-moderated experimental/research project.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:06",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Human Anatomy And Physiology: An Introduction To The Medical Science",
         "description":"Human Anatomy and Physiology provides students with an in-depth understanding and working knowledge of the human body. It covers human body systems with an emphasis on the mechanisms that maintain homeostasis. Lab activities cover both the physiological and anatomical aspects of human biology. Students have the opportunity to explore careers in the medical sciences. An independent project is required. If dissections are part of the laboratory experience, alternatives are available. This course does not count as one of the science credits for the standard diploma. It can be used as the fourth science credit for an advanced studies diploma if the student has already taken three science courses from three different disciplines.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:10",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Biology",
         "description":"After completing the core science curriculum, students pursue a more advanced and specialized study of biology topics. Students conduct standard first year college-level laboratory research as well as analyze and interpret biological data. Students engage in authentic science practices and examine biology content within four big ideas: 1) the process of evolution drives the diversity of life, 2) biological systems utilize energy and molecular building blocks to grow, reproduce and maintain homeostasis, 3) living systems retrieve, transmit, and respond to information essential to life processes, and 4) biological systems interact, and these interactions possess complex properties. If dissections are part of the laboratory experience, alternatives are available. Students are required to take the Advanced Placement exam for which college credit and/or placement may be given if a qualifying score is achieved.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:40",
				"-1:00/0:40",
				"-1:00/0:40",
				"-1:00/0:40",
				"-1:00/0:40",
				"-1:00/0:40",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Chemistry",
         "description":"Advanced Placement Chemistry represents a full year (two semesters) of college chemistry. The purpose of this course is to prepare students to take the Advanced Placement examination, for which college credit and/or placement may be given if a qualifying score is achieved. Advanced Placement Chemistry is a second-level, laboratory-centered course that provides an opportunity for students to undertake a more comprehensive investigation at a level above Chemistry 1 It is designed for students who have completed a core science curriculum and are now ready to pursue more advanced and specialized studies. Students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:20",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Astronomy",
         "description":"Astronomy deals with topics such as the universe, universal laws, galaxies, stellar evolution, the solar system and its motion, and the exploration of space. This course is designed to be an in-depth and mathematical survey of astronomy concepts. This course does not count as one of the science credits for the standard diploma. It can be used as the fourth credit for an advanced studies diploma, if the student has already taken three science courses from three different disciplines.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Advanced Placement Environmental Science",
         "description":"The AP Environmental Science course is designed to be the equivalent of a one-semester, introductory college course in environmental science and is designed to stress scientific principles and analysis. The course includes a laboratory component. Students examine how science is a process, how energy conversions underlie all ecological processes, and how the Earth is one interconnected system. Students will explore how humans alter the natural system and the cultural and social context of environmental problems. Major topics include earth systems and resources, the living world, population, land and water use, energy resources and consumption, pollution, and global change. Students are required to take the Advanced Placement exam, and may be given college credit and/or placement if a qualifying score is achieved.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:30",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advance Placement Physics C - Mechanics And Electricity And Magnetism",
         "description":"Advanced Placement Physics is a second-level course which surveys a broad selection of physics topics at a level above Physics 1. It is designed for students who have completed a core science curriculum and are now ready to pursue more advanced and specialized studies in mechanics, electricity, and magnetism. AP Physics C serves as the foundation in physics for students who wish to pursue physical science or engineering degrees. Students are required to take both the Mechanics Advanced Placement exam and the Electricity and Magnetism Advanced Placement exam and may be given college credit and/or placement if a qualifying score is achieved.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
				"-1:00/0:26",
				"-1:00/0:26",
				"-1:00/0:26",
				"-1:00/0:26",
				"-1:00/0:26",
				"-1:00/0:26",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Science Research",
         "description":"This course is designed for students who want to concentrate on a long term independent research project. Students will go into more depth on the research process, and are required to compete in an approved science competition. This course does not meet the science graduation requirements, but can be used as an elective credit.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Engineering Physics",
         "description":"This course may be used to satisfy one credit toward the science, elective, fine arts, or career and technical education requirement of the standard or advanced studies diploma. The course is the second year of the two-year college preparatory, laboratory-based Engineering Physics sequence; and is designed for students anticipating careers in the physical sciences, engineering, technology, medicine, or other research, and experimentation disciplines. The course begins with a review of mathematical and basic physics and engineering concepts to assure that all students are brought to a consistent level of preparedness. Curriculum topics include universal concepts, inquiry processes, fundamental constants, special relativity, rotational dynamics, waves and vibrations, energy conversion, transducers, electromagnetic radiation, optical measurements, and exponential behavior. These topics are addressed in the context of mechanical, fluid, electrical, thermal, and aerospace systems. Students complete approximately 50 hours of laboratory experimentation and participation in advanced technology competitions. The course may include curriculum-related field trips and college-oriented information seminars. Individual academies apply the curriculum in the manner that best fits local facilities and opportunities. Participating students may compete for a limited number of industry internships.",
         "superCategory":"Classes",
         "category":"science",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Advanced Placement World History",
         "description":"Advanced Placement World History is designed to develop greater understanding of the evolution of global processes and contacts, in interaction with different types of human societies. This understanding is advanced through a combination of selective factual knowledge and appropriate analytical skills. Focused primarily on the past fifteen hundred years of the global experience, the course builds on an understanding of cultural, institutional, and technological precedents that, along with geography, set the human stage prior to 600. All students are required to take the Advanced Placement World History exam. This course may be used to satisfy the World History and Geography I requirement or to satisfy the World History and Geography II requirement. Note: When taken as a World History and Geography I or II substitute course, the appropriate World History and Geography SOL Test is required. The SOL Test is not given when AP World is taken as an elective.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/1:15",
				"-1:00/1:15",
				"-1:00/1:15",
				"-1:00/1:15",
				"-1:00/1:15",
				"-1:00/1:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Virginia And United States History",
         "description":"Students examine the political, economic, social, and cultural changes of the United States, including the role of Virginia. Students study major historical developments and their impact on contemporary society and on the individual. Geography skills, critical thinking, writing, research, and group-process skills are refined. Additionally, students will apply social science skills -historical thinking, geographic analysis, economic decision making, and responsible citizenship  to course content. Virginia and United States History is required for graduation.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Virginia And United States History Honors",
         "description":"Virginia and United States History Honors deepens and advances the curriculum of Virginia and United States History. Students examine the political, economic, social, and cultural changes of the United States, including the role of Virginia. Students study major historical developments and their impact on contemporary society and on the individual. Geography skills, critical thinking, writing, research, and group-process skills are refined. Additionally, students will apply social science skills -historical thinking, geographic analysis, economic decision making, and responsible citizenship  to course content. Virginia and United States History is required for graduation.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement United States History",
         "description":"In this course students develop the factual knowledge and analytical skills necessary to deal with the issues and problems of American History. They do in-depth analysis of major developments; become familiar with primary sources; assess historical materials, evidence, and interpretations; and learn to write research papers. This course prepares students to take the Advanced Placement examination in American History for which college credit and/or placement may be given if a qualifying score is made. All students are required to take the Advanced Placement exam. The course is equal to a full-year introductory college course. Completion of this course fulfills the graduation requirement for one credit in Virginia and United States History.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/1:00",
				"-1:00/1:00",
				"-1:00/1:00",
				"-1:00/1:00",
				"-1:00/1:00",
				"-1:00/1:00",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Human Geography",
         "description":"The purpose of Advanced Placement Human Geography is to introduce students to the systematic study of patterns and processes that have shaped human understanding, use, interaction with, and alteration of the earth's surface. Students will use spatial concepts and landscape analysis to analyze human social organization and its environmental consequences. They also will learn about the methods and tools geographers use in their science and practice. This course prepares students to take the Advanced Placement examination in Human Geography, for which college credit and/or placement is given if a qualifying score is achieved. All students are required to take the Advanced Placement Human Geography exam.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:15",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:12",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Macro And Microeconomics",
         "description":"This course is designed to provide students with an understanding of the economic principles which apply to an economic system as a whole. This course is designed to provide students with an understanding of the principles of economics which apply to the functions of decision-makers, both consumers and producers, within economic systems. Topics include, national economics, international economics, the nature and functions of product markets, the study of factor markets, and the role of government in promoting greater efficiency and equity in the economy. All students are required to take both Advanced Placement examinations in Macro and Micro Economics, for which college credit and/or placement may be given if a qualifying score is achieved. This course fulfills the Economic and Personal Finance and virtual graduation requirements.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:15",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Psychology",
         "description":"In this course, students examine patterns and variations of human behavior and the process of individual human development. They identify and examine the emotional, cognitive, and physical factors which influence the development of the individual human being. Students distinguish among the major schools and systems of psychology and methods of investigation.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:05",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement Psychology",
         "description":"The purpose of this course is to introduce students to the systematic and scientific study of the behavior and mental processes of human beings and other animals. Students are exposed to the psychological facts, principles, and phenomena associated with each of the major subfields within psychology. They also learn about the methods psychologists use in their science and practice. The aim of Advanced Placement Psychology is to provide the students with a learning experience equivalent to that obtained in an introductory college psychology course. College credit and/or placement may be given if a qualifying score is made on the Advanced Placement examination. The rigorous course syllabus and college level texts both suggest that students who enroll should be highly motivated and intellectually curious. All students are required to take the Advanced Placement exam.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:25",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Sociology",
         "description":"This elective course examines the ways individuals and groups function in society, analyzes social constructs, and explores societal behaviors and beliefs. Students develop hypotheses about society and gather information to test their claims.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:05",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:03",
				"-1:00/0:00"
         ]
      },
      {
         "name":"Advanced Placement European History",
         "description":"The Advanced Placement Program in European History covers the basic chronology of events from 1450 (the High Renaissance) to the present. Students are expected to demonstrate a knowledge of this basic chronology and of major events and trends in the intellectual cultural, political-diplomatic, and social-economic history of modern Europe. In addition, students are expected to demonstrate an ability to analyze historical evidence and to express that understanding and analysis in writing. All students are required to take the Advanced Placement examination in European History, for which college credit and/or placement is given if a qualifying score is achieved.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
				"-1:00/0:10",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:06",
				"-1:00/0:00"
         ]
      },
      {
         "name":"World  Religions",
         "description":"In this course, students develop the background knowledge and habits of mind necessary for an appreciation of the basic beliefs and practices of the world's religions. Importance is placed on historical origins as well as current beliefs. Students will study Buddhism, Christianity, Confucianism, Hinduism, Islam, Judaism, Shintoism, Taoism, and other belief systems.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Law In Action",
         "description":"This course provides practical information and problem-solving opportunities regarding the law. Students develop both knowledge of the law and skills necessary for survival in our law-based society. Classes engage in active learning experiences such as mock trials, moot courts, role plays, case studies, simulations and small group exercises. Students explore the definition of law, citizen rights and responsibilities under the law, learn methods of dispute resolution, as well as identify and analyze public issues involving the law.",
         "superCategory":"Classes",
         "category":"social studies",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Foundations Of English 9-12",
         "description":"Foundations of English, 9-12, is a one-credit elective course designed to support instruction along the FCPS Program of Studies and the VA Aligned Standards of Learning (ASOL) in the identified content area; does not require SOL testing. Students may enroll in this elective class each year of HS participation. Instruction is individualized based on needs identified in the IEP to help students gain a basic content vocabulary, knowledge and skills and designed to be taught at the learning pace of the individual students. Participation in Foundations courses will aid the student in fulfilling requirements of the Virginia Alternative Assessment Program (VAAP) and meet the requirements for an Applied Studies Diploma.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Foundations Of Science",
         "description":"Foundations of Science is a one-credit elective course designed to support instruction along the FCPS Program of Studies and the VA Aligned Standards of Learning (ASOL) in the identified content area; does not require SOL testing. Students may enroll in this elective class each year of HS participation. Instruction is individualized based on needs identified in the IEP to help students gain a basic content vocabulary, knowledge and skills and designed to be taught at the learning pace of the individual students. Participation in Foundations courses will aid the student in fulfilling requirements of the Virginia Alternative Assessment Program (VAAP)and meet the requirements for an Applied Studies Diploma.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Foundations Of World History And Geography",
         "description":"Foundations of World History/Geography is a one-credit elective course designed to support instruction along the FCPS Program of Studies and the VA Aligned Standards of Learning (ASOL) in the identified content area; does not require SOL testing. Students may enroll in this elective class each year of HS participation. Instruction is individualized based on needs identified in the IEP to help students gain a basic content vocabulary, knowledge and skills and designed to be taught at the learning pace of the individual students. Participation in Foundations courses will aid the student in fulfilling requirements of the Virginia Alternative Assessment Program (VAAP) and meet the requirements for a Special Diploma.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Individualized Mathematics",
         "description":"The purpose of this course is to provide instruction of foundational mathematics skills to special education students who are functioning more than two years below grade level in mathematics. The course is designed to present the foundational skills necessary to enter Algebra 1 using manipulatives, special materials, and adaptive strategies. The course may include number concepts, mental mathematics, estimation, problem solving, operations, measurement, geometry, data analysis, statistics, probability, and fractions. This course should be reflected in the student's IEP. This course does not meet the mathematics graduation requirements for the Standard or Advanced Studies Diploma. Students earn elective credit.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:15",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Personal Living And Finance",
         "description":"Students learn how to navigate the financial decisions they must face and to make informed decisions related to budgeting, banking, credit, insurance, spending, taxes, saving, investing, buying/leasing a vehicle, living independently, and inheritance. Instruction in personal finance prepares students to function effectively as consumers, savers, investors, entrepreneurs, and active citizens. This course has been augmented to include the 21 Workplace Readiness Skills (WRS) and upon completion of this course, students may take the WRS assessment, and if successful, receive a Career and Technical Education (CTE) credential. This course is an allowable credit accommodation for students pursuing a standard diploma and may satisfy the Economics and Personal Finance requirement if the student has earned at least 3 credits in history and social science.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Reinforcing Foundations",
         "description":"Reinforcing Foundations is a one credit elective course designed to provide support to tenth, eleventh, and/or twelfth grade high school special education students who have not yet passed the eighth grade English: Reading/Literature and Research and Mathematics Standard of Learning tests and may be pursuing a modified standard diploma or a special diploma. This course will include skill work in reading comprehension, research, literature, computation, estimation, measurement, patterns, and basic algebra. This course may be taught for elective credit for three years, as appropriate. Students may be awarded a half-credit upon completion of a full semester of placement in Reinforcing Foundations. Such a decision is made by the school counselor in conjunction with the special education department chair.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Literacy Essentials",
         "description":"This course is designed to provide direct, explicit and intensive literacy instruction to students with disabilities who are reading and./or writing significantly below grade level. Basic objectives of this literacy course is focused on closing the gap between the student's present level of performance and the level of performance needed to successfully access the general curriculum. Instruction focuses on increasing student's decoding, fluency and comprehension skills of fiction and nonfiction materials, and improving writing skills across the curriculum which is based on the diagnosis of each student's needs as outlined through the student's Individual Education Program (IEP). Students successfully completing two years of this course will satisfy the sequential elective requirement for the Standard Diploma and the Standard Diploma with credit accommodations.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Strategies For Success",
         "description":"This elective course is designed to provide support to a student in core curricular areas and to provide direct instruction in specific learning strategies, study skills, time management, organization, and self-advocacy skills. Time is also allotted to address individual areas of need as identified in a student's Individual Educational Plan (IEP). While students may receive assistance on core curricular assignments, the course is not designed to serve as a study hall. Students enrolled in the course receive the equivalent of one period of instruction each day and earn an elective credit. This course may be taught for an elective credit all four years or more, as appropriate. Students successfully completing two years of this course will satisfy the sequential elective requirement for the Standard and Modified Standard Diploma. (Students may be awarded a half-credit upon completion of a full semester of placement in the Strategies for Success course. Such a decision is made by the school counselor in conjunction with the special education department chair.)",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00",
            "-1:00/0:00"
         ]
      },
      {
         "name":"Career Preparation",
         "description":"This is an adapted curriculum elective geared to students needing intensive support. Instruction is very concrete with extensive physical modeling and assistance. Work experience may take place in the community, around the school, or in the classroom. This course is designed for students who are likely to age out of FCPS and work with the Community Services Board to select a day support or employment agency able to meet their support needs. This course is taught by adapted curriculum teachers. The course will identify work-related abilities, provide training and work skills, and prepare students for post-secondary participation in community-based worksites.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Education For Employment Level 1",
         "description":"This course teaches students to make informed career and continuing education choices as they transition from school, gain technical skills, and adapt to the workplace. Students are taught ethical behaviors and career-research, job-acquisition, workplace-communication, self- awareness, self-advocacy, customer-service, and life skills. Students successfully completing two years of this course will satisfy sequential elective requirements prescribed in certain diplomas.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Education For Employment Level 2",
         "description":"This course teaches students to make informed career and continuing education choices as they transition from school, gain technical skills, and adapt to the workplace. Students are taught ethical behaviors and career-research, job-acquisition, workplace-communication, self- awareness, self-advocacy, customer-service, and life skills. Students successfully completing two years of this course will satisfy sequential elective requirements prescribed in certain diplomas.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Education For Employment For The Office",
         "description":"This course teaches students to make informed career and continuing education choices as they transition from school, gain technical skills, and adapt to the workplace. Students are taught ethical behaviors and career-research, job-acquisition, workplace-communication, self-awareness, self-advocacy, customer-service, MS Office applications, and to perform assignments essential to the operation of an office in a school or community business. This course can be taken for more than one year. Students successfully completing two years of this course will satisfy the sequential elective requirement for certain diploma options.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Life Skills",
         "description":"This comprehensive individualized program is designed to prepare students for a style of living that will require a minimum of dependence on family. The course is geared to meet the needs of the students as they prepare to enter employment and emphasizes developing interpersonal skills, following directions, working independently, completing a task, and developing self-advocacy and other community living skills.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"Personal Development",
         "description":"This course is designed to provide instruction to enhance personal development and interpersonal skills for students with disabilities. In addition, this course will provide social and/or emotional support in order to progress in the general education curriculum. Students who participate in the course have documented social and /or emotional needs in their individualized education program (IEP) and/or have a Behavior Intervention Plan (BIP). The areas of instruction for this course include peer relations, self-management, academic skills, compliance skills, and assertion skills. This course may be taught for an elective credit all four years or more, as appropriate. Students successfully completing two years of this course will satisfy the sequential elective requirement for the Standard and Modified Standard Diploma.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      },
      {
         "name":"World Awareness And Transition",
         "description":"This option is available to high school students receiving special education services. Students explore potential career options while developing/improving skills needed for success in employment such as interpersonal/co-worker relationships and self-advocacy skills. Students participate in career activities and work-based learning, explore various educational options, and develop or revise a plan related to their academic and career-related goals.",
         "superCategory":"Classes",
         "category":"special education",
         "times":[
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00",
            "-1:00/00:00"
         ]
      }
   ]
}